<?xml version='1.0' encoding='iso-8859-1'?>
<!-- $Revision: 1.2 $ -->
 <reference id="ref.mcve">
  <title>MCVE (Paiement)</title>
  <titleabbrev>MCVE</titleabbrev>

  <partintro>
   <section id="mcve.intro">
   &reftitle.intro;
    <para>
     Ces fonctions font l'interface avec l'API MCVE (libmcve), et
     permettent l'acc&egrave;s direct aux fonctions MCVE depuis les
     scripts PHP. MCVE est la solution de paiement en ligne de
     Main Street Softworks, qui permet de traiter des cartes de
     cr&eacute;dits. Il vous permet d'utiliser directement le num&eacute;ro de
     carte de cr&eacute;dit, et de l'envoyer &agrave; la maison de paiement via
     votre serveur Unix, avec connexion modem ou internet : il
     permet de vous passer de services comme Authorize.Net ou Pay
     Flow Pro). En utilisant le module MCVE de PHP, vous pouvez
     traiter des cartes de cr&eacute;dit directement depuis vos scripts
     PHP. La r&eacute;f&eacute;rence suivante va vous d&eacute;crire le processus.
    </para>
    <note>
     <para>
      MCVE est la solution de remplacement pour le module de RedHat CCVS.
      Ils ont conclu un accord avec RedHat &agrave; la fin de l'ann&eacute;e 2001 pour
      migrer tous leur clients vers la plateforme MCVE.
     </para>
    </note>
   </section>
   <section id="mcve.installation">
    &reftitle.install;
    <para>
     Pour activer le support MCVE de &php; commencez par v&eacute;rifier
     si la librairie LibMCVE est install&eacute;e. Vous avez alors &agrave; configurer
     PHP avec l'option <option role="configure">--with-mcve</option>.  
     Si vous utilisez cette option sans autre d&eacute;tails, PHP essaiera
     de trouver la librairie LibMCVE dans son dossier standard
     (/usr/local).  Si MCVE est dans un dossier non-standard, 
     utilisez la forme suivante : <option role="configure">--with-mcve=$mcve_path</option>, 
     o&ugrave; $mcve_path est le chemin menant &agrave; votre installation MCVE.
     Notez que MCVE requiert que $mcve_path/lib et $mcve_path/include existent,
     et qu'ils incluent mcve.h dans le dossier include, et libmcve.so et/ou
     libmcve.a dans le dossier lib.
    </para>
    <para>
     Comme MCVE vient avec une v&eacute;ritable s&eacute;paration client/serveur, il n'y a pas
     de pr&eacute;-requis suppl&eacute;mentaires pour compiler PHP avec le support 
     MCVE. Pour tester votre extension MCVE avec PHP, connectez vous 
     au site testbox.mcve.com sur le port 8333 pour le mode IP, ou le port 8444 
     pour le mode SSL. Utilisez 'vitale' comme nom d'utilisateur et 'test' 
     comme mot de passe. Plus de d&eacute;tails sur ce syst&egrave;me de test sont
     disponibles &agrave; <ulink url="http://www.mcve.com">www.mcve.com</ulink>.
    </para>
   </section>
   
   <section id="mcve.seealso">
    &reftitle.seealso;
    <para>
     Plus de documentation sur l'API PHP de MCVE est disponible &agrave;
     <ulink url="http://www.mcve.com/docs/phpapi.pdf">
     http://www.mcve.com/docs/phpapi.pdf</ulink>. La documentation
     &eacute;dit&eacute;e par Main Street est compl&egrave;te et est la source primaire
     d'information.
    </para>
   </section>

  </partintro>

&reference.mcve.functions;

 </reference>
<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->

