<?xml version="1.0" encoding="iso-8859-1"?>
 <reference id="ref.sesam">
  <title>SESAM</title>
  <titleabbrev>SESAM</titleabbrev>
  <partintro>
   <para>
    SESAM/SQL-Server est une base de donn&eacute;es mainframe, d&eacute;velopp&eacute;e
    par Fujitsu Siemens Computers, Allemagne. Elle fonctionne sur les
    serveur mainframe, sous BS2000/OSD.
   </para>
   <para>
    Sur de nombreuses installation BS2000 en production, SESAM/SQL-Server
    a prouv&eacute; ...
    <itemizedlist>
     <listitem>
      <simpara>
       La facilit&eacute; de connectivit&eacute; Java, Web et client/serveur
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       La disponibilit&eacute; de plus de 99.99%,
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       La capacit&eacute; de g&eacute;rer des dizaines et m&ecirc;mes des centaines de milliers
       d'utilisateurs.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
   <para>
    D&eacute;sormais, il existe une interface PHP pour SESAM, qui donne
    l'acc&egrave;s &agrave; cette base aux scripts PHP.
   </para>
   <note>
    <title>Notes de configuration</title>
    <para>
     Il n'y a pas de support pour l'interface SESAM si PHP est un CGI :
     elle ne fonctionne que comme module Apache. En module Apache,
     l'interface <link linkend="ini.sect.sesam">SESAM</link> peut &ecirc;tre
     configur&eacute;e avec les directives Apache.
     <table>
      <title>Directives de configuration SESAM</title>
      <tgroup cols="2">
       <thead>
        <row>
	  	 <entry>Directive</entry>
 		 <entry>Signification</entry>
        </row>
       </thead>
       <tbody>
        <row>
	  	 <entry>
	  	  <literal>php3_sesam_oml</literal>
	  	 </entry>
 		 <entry>
 		  Nom de la librairie BS2000 PLAM contenant le module du pilote
 		  SESAM. Ceci est obligatoire pour utiliser les fonctions SESAM.
	      <para>
	        Exemple:
	        <informalexample>
             <programlisting role="apache">
php3_sesam_oml $.SYSLNK.SESAM-SQL.030
			</programlisting>
           </informalexample>
	      </para>
         </entry>
        </row>
        <row>
 		 <entry>
 		  <literal>php3_sesam_configfile</literal>
 		 </entry>
 		 <entry>
 		  Nom du fichier de configuration de l'application SESAM.
 		  Ceci est obligatoire pour utiliser les fonctions SESAM.
	      <para>
	       Exemple:
	       <informalexample>
            <programlisting role="apache">
php3_sesam_configfile $SESAM.SESAM.CONF.AW
             </programlisting>
            </informalexample>
           Ce fichier contient g&eacute;n&eacute;ralement une configuration comme celle
           ci (voir dans le manuel de r&eacute;f&eacute;rence SESAM):
	       <informalexample>
            <programlisting role="bs2000">
CNF=B
NAM=K
NOTYPE
             </programlisting>
            </informalexample>
           </para>
         </entry>
        </row>
        <row>
 	     <entry>
 	      <literal>php3_sesam_messagecatalog</literal>
 	     </entry>
 	     <entry>
 	      Nom du fichier de messages SESAM. Dans la plupart des cas,
 	      cette directive n'est pas n&eacute;cessaire. Uniquement si le fichier
 	      de messages SESAM n'es pas install&eacute; dans la table de messages
 	      BS2000. Il peut alors &ecirc;tre choisi avec cette directive.
          <para>
	       Exemple:
           <informalexample>
            <programlisting role="apache">
php3_sesam_messagecatalog $.SYSMES.SESAM-SQL.030
            </programlisting>
           </informalexample>
          </para>
         </entry>
        </row>
       </tbody>
      </tgroup>
     </table>
    </para>
    <para>
     En plus de la configuration de l'interface PHP/SESAM, vous devez
     aussi configurer le serveur SESAM-Database sur votre mainframe,
     comme d'habitude. Cela signifie notamment qu'il faut :
     <itemizedlist>
      <listitem>
       <simpara>
        d&eacute;marrer le gestionnaire de base SESAM (DBH)
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        connecter les bases avec le gestionnaire de bases SESAM
       </simpara>
      </listitem>
     </itemizedlist>
    </para>
    <para>
     Pour connecter un script PHP au serveur de bases SESAM, les param&egrave;tres
     <literal>CNF</literal> et <literal>NAM</literal> de la configuration
     SESAM selectionn&eacute;e doivent correspondre &agrave; l'id du gestionnaire de
     base d&eacute;marr&eacute;.
    </para>
    <para>
     Dans le cas des bases de donn&eacute;es distribu&eacute;es, vous devez d&eacute;marrer
     un agent SESAM/SQL-DCN, avec la table de distribution incluant
     le nom de l'h&ocirc;te et de la base de donn&eacute;es.
    </para>
    <para>
     La communication entre PHP (fonctionnant sur le sous-syst&egrave;me POSIX)
     et le gestionnaire de base (fonctionnant hors du sous-syst&egrave;me POSIX)
     est r&eacute;alis&eacute;e par un pilote sp&eacute;cial appel&eacute; SQLSCI et le module de
     connexion SESAM, qui utilise la m&eacute;moire partag&eacute;e. A cause de la m&eacute;moire
     partag&eacute;e, et parce que PHP est une partie statique du serveur web, les
     acc&egrave;s &agrave; la base de donn&eacute;es sont extr&ecirc;mement rapide, car il ne requi&egrave;rent
     pas de connexion distante via ODBC, JDBC ou UTM.
    </para>
    <para>
     Seul un chargeur de stub (stub loader, SESMOD) est compil&eacute; dans PHP.
     Les modules de connexion SESAM proviennent de la librairie OML PLAM.
     Dans la <link linkend="ini.sect.sesam">configuration</link>, vous devez
     indiquer &agrave; PHP le nom de la librairie PALM, et le fichier de lien &agrave;
     utiliser pour la configuration de SESAM (En SESAM V3.0, SQLSCI est
     disponible dans la librairie d'outils SESAM (SESAM Tool Library), qui
     fait partie de la distribution standard).
    </para>
    <para>
     Les commandes SQL imposent que les guillemets simples soient doubl&eacute;s
     pour &ecirc;tre interpr&eacute;t&eacute; lit&eacute;ralement (contrairement &agrave; d'autres bases
     de donn&eacute;es qui utilisent un guillemet simple, pr&eacute;c&eacute;d&eacute; d'un antislash),
     il est recommand&eacute; d'activer les directives PHP
     <link linkend="ini.magic-quotes-gpc"><literal>php3_magic_quotes_gpc</literal></link>
     et
     <link linkend="ini.magic-quotes-sybase"><literal>php3_magic_quotes_sybase</literal></link>.
    </para>
   </note>
   <note>
    <title>Ex&eacute;cutions</title>
    <para>
     A cause des limitations du mod&egrave;le de processus BS2000, le pilote
     peut &ecirc;tre charg&eacute; uniquement apr&egrave;s que le serveur Apache ait g&eacute;n&eacute;r&eacute;
     le processus fils. Cela ralentit l&eacute;g&egrave;rement le traitement de la premi&egrave;re
     requ&ecirc;te, mais toutes les requ&ecirc;tes suivantes seront effecut&eacute;e
     &agrave; pleine vitesse.
    </para>
    <para>
     Lorsque vous d&eacute;finissez explicitement le catalogue de messages
     SESAM, ce catalogue ser charg&eacute; &agrave; chaque fois que le pilote est
     charg&eacute; (i.e., au moment de la requ&ecirc;te initiale). Le syst&egrave;me
     d'exploitation BS2000 affiche un message apr&egrave;s avoir correctement
     charg&eacute; le catalogue de messages, qui sera envoy&eacute; au fichier
     d'erreurs Apache. BS2000 ne permet pas la suppression de ce
     message, qui va remplir progressivement ce fichier.
    </para>
    <para>
     Assurez vous que la librairie SESAM OML PLAM et le fichier de
     configuration SESAM sont accessibles par l'utilisateur qui
     fait tourner le serveur web. Sinon, le serveur ne sera pas
     capable de charger le pilote, ou d'appeler les fonctions
     SESAM. L'acc&egrave;s &agrave; la base doit &ecirc;tre donn&eacute; &agrave; cet utilisateur.
     Sinon, les connexions SESAM &eacute;choueront.
    </para>
   </note>
   <note>
    <title>Types de curseurs</title>
    <para>
     Les curseurs de r&eacute;sultat sont allou&eacute;s pour les requ&ecirc;tes
     SQL de selection, peuvent &ecirc;tre soit "s&eacute;quentiels", soit
     "&agrave; d&eacute;filement" ("scrollable"). Les curseurs &agrave; d&eacute;filement
     sont beaucoup plus gourmands en m&eacute;moire, et le mode
     par d&eacute;faut est s&eacute;quentiel.
    </para>
    <para>
     Lorsque vous utilisez les curseurs &agrave; d&eacute;filement, le curseur
     peut &ecirc;tre positionn&eacute; librement dans le r&eacute;sultat. Pour chaque
     requ&ecirc;te &agrave; d&eacute;filement, il existe des valeurs globales de
     types de d&eacute;filement (initialis&eacute;e &agrave; :<literal>SESAM_SEEK_NEXT</literal>)
     et la position peut &ecirc;tre fix&eacute;e une seule fois par
     <function>sesam_seek_row</function> ou bien &agrave; chaque appel,
     avec la fonction <function>sesam_fetch_row</function>. Lorsque
     vous lisez une ligne avec un curseur &agrave; d&eacute;filement, le traitement
     suivant est effectu&eacute; &agrave; partir des valeurs globales de type
     de d&eacute;filement et de position :
     <table>
      <title>Scrolled Cursor Post-Processing</title>
      <tgroup cols="2">
       <thead>
        <row>
	  	 <entry>Type de d&eacute;filement</entry>
 		 <entry>Action</entry>
        </row>
       </thead>
       <tbody>
        <row>
	 	 <entry>
	 	  <literal>SESAM_SEEK_NEXT</literal>
	 	 </entry>
 	     <entry>aucun</entry>
        </row>
        <row>
 	     <entry>
 	      <literal>SESAM_SEEK_PRIOR</literal>
 	     </entry>
 	     <entry>aucun</entry>
        </row>
        <row>
 	     <entry>
 	      <literal>SESAM_SEEK_FIRST</literal>
 	     </entry>
 	     <entry>
 	      le type de d&eacute;filement devient <literal>SESAM_SEEK_NEXT</literal>
 	     </entry>
        </row>
        <row>
 	     <entry>
 	      <literal>SESAM_SEEK_LAST</literal>
 	     </entry>
 	     <entry>
 	      le type de d&eacute;filement devient <literal>SESAM_SEEK_PRIOR</literal>
 	     </entry>
        </row>
        <row>
    	 <entry>
    	  <literal>SESAM_SEEK_ABSOLUTE</literal>
    	 </entry>
 	     <entry>
 	      incr&eacute;mente automatiquement la valeur interne de position
 	     </entry>
        </row>
        <row>
 	     <entry>
 	      <literal>SESAM_SEEK_RELATIVE</literal>
 	     </entry>
 	     <entry>
 	      aucune. conserve les valeurs globales par d&eacute;faut de
 	      position, ce qui permet, par exemple de lire toutes
 	      les 10 lignes, en arri&egrave;re.
         </entry>
        </row>
       </tbody>
      </tgroup>
     </table>
    </para>
   </note>
   <note>
    <title>
     Porting note
    </title>
    <para>
     En PHP, il est naturel de commencer les index &agrave; z&eacute;ro (plut&ocirc;t
     que 1), et quelques adaptations ont &eacute;t&eacute; faite pour l'interface
     SESAM : &agrave; chaque fois qu'un tableau index&eacute; commence &agrave; l'index 1
     en SESAM natif, l'interface PHP utilisera l'index 0 comme point de
     d&eacute;part. Par exemple, lorsque vous lisez des donn&eacute;es avec
     <function>sesam_fetch_row</function>, la premi&egrave;re colonne
     sera &agrave; l'index 0, et les suivantes suivront juqu'au nombre
     de colonne (exclus) du r&eacute;sultat ($array["count"]).
     Lors du portage d'applications depuis d'autres langage &eacute;volu&eacute;s vers
     le PHP, soyez attentifs &agrave; ce changement. A chaque fois que
     c'est n&eacute;cessaire, la description d'une fonction PHP SESAM indique
     que l'index du tableau commence &agrave; 0.
    </para>
   </note>
   <note>
    <title>S&eacute;curit&eacute;</title>
    <para>
     Lorsque vous autorisez l'acc&egrave;s &agrave; une base de donn&eacute;es SESAM, le
     serveur web doit avoir le minimum de privil&egrave;ges possible. Pour la
     plupart des bases de donn&eacute;es, seul le droit de lecture doit &ecirc;tre
     fourni. Suivant votre utilisation, ajoutez d'autres droits d'acc&egrave;s
     au fur et &agrave; mesure de vos besoins. Ne donnez jamais le contr&ocirc;le
     total de vos bases &agrave; un utilisateur du web! Limitez l'acc&egrave;s aux
     scripts PHP qui doivent administrer la base en utilisant un
     mot de passe et/ou une s&eacute;curisation SSL.
    </para>
   </note>
   <note>
    <title>Migration d'une autre base SQL</title>
    <para>
     Deux langage SQL ne sont jamais 100% compatibles. Lorsque vous portez
     une application SQL depuis une autre interface vers SESAM,
     certaines adaptation doivent &ecirc;tre fa&icirc;tes. Les diff&eacute;rences suivantes
     sont les plus courantes :
     <itemizedlist>
      <listitem>
       <simpara>
        Types de donn&eacute;es sp&eacute;cifiques
       </simpara>
       <simpara>
        Certains types de donn&eacute;es sp&eacute;cifiques &agrave; une base doivent &ecirc;tre
        remplac&eacute;s par les types de donn&eacute;es standard SQL.
        (i.e., <literal>TEXT</literal> doit &ecirc;tre remplac&eacute; par
        <literal>VARCHAR(taille max)</literal>).
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        Mots reserv&eacute;s comme identifiants SQL.
       </simpara>
       <simpara>
        En SESAM (comme dans le standard SQL), les mots
        reserv&eacute;s utilis&eacute;s comme identifiants doivent &ecirc;tre entour&eacute;s
        de guillemets doubles (ou renomm&eacute;s).
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        Taille d'affichage des donn&eacute;es.
       </simpara>
       <simpara>
        Les types de donn&eacute;es SESAM ont une taille de stockage, mais
        par de taille d'affichage. A la place de <literal>int(4)</literal>
        (c'est &agrave; dire : les entiers jusqu'&agrave; '9999'), SESAM requiert simplement
        <literal>int</literal>, pour une taille implicite de 31 bits. De m&ecirc;me,
        les seuls types de date disponible dans SESAM sont :
        <literal>DATE</literal>, <literal>TIME(3)</literal> et
        <literal>TIMESTAMP(3)</literal>.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        Les types de donn&eacute;es <literal>unsigned</literal> (non sign&eacute;),
        <literal>zerofill</literal> (compl&eacute;t&eacute; avec des z&eacute;ros), ou
        <literal>auto_increment</literal>
       </simpara>
       <simpara>
        <literal>Unsigned</literal> et <literal>zerofill</literal> ne sont pas
        support&eacute;s. <literal>Auto_increment</literal> est automatique
        (utilisez <literal>"INSERT ... VALUES(*, ...)"</literal> au lieu de
        <literal>"... VALUES(0,...)"</literal> pour profiter des auto-increment
        implicites de SESAM.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <command>int ... DEFAULT '0000'</command>
       </simpara>
       <simpara>
        Les variables num&eacute;riques ne doivent pas &ecirc;tre initialis&eacute;es
        avec des constantes de type cha&icirc;ne de caract&egrave;res. Utilisez
        <command>DEFAULT 0</command> &agrave; la place. Pour initialiser une
        date, la cha&icirc;ne doit &ecirc;tre pr&eacute;fix&eacute;e avec le type de date
        adapt&eacute;, tel que :
        <literal> CREATE TABLE exmpl (xtime timestamp(3) DEFAULT TIMESTAMP '1970-01-01 00:00:00.000' NOT &null;); </literal>
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <command>$count = xxxx_num_rows();</command>
       </simpara>
       <simpara>
        Certaines bases de donn&eacute;es essaient d'estimer le nombre
        de lignes d'un r&eacute;sultat, m&ecirc;me grossi&egrave;rement approximativement.
        SESAM ne connait pas le nombre de lignes avant de les
        avoir lues lui-m&ecirc;me. Si vous avez vraiment besoin de
        les compter, utilisez la commande
        <command>SELECT COUNT(...) WHERE ...</command>, qui vous dira
        combien de lignes sont disponibles. Une deuxi&egrave;me requ&ecirc;te
        devrait vous retourner tous ces r&eacute;sultats.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        <command>DROP TABLE lenom;</command>
       </simpara>
       <simpara>
        Avec SESAM, dans la commande <command>DROP TABLE</command>,
		le nom de la table doit &ecirc;tre suivi du mot cl&eacute;
		<literal>RESTRICT</literal> ou <literal>CASCADE</literal>. Avec
		<literal>RESTRICT</literal>, une erreur est retounr&eacute;e si il y a des
		objets d&eacute;pendant (par exemple, des vues), tandis qu'avec
		<literal>CASCADE</literal>, les objets d&eacute;pendants seront
		supprim&eacute;s en m&ecirc;me temps que la table.
       </simpara>
      </listitem>
     </itemizedlist>
    </para>
   </note>
   <note>
    <title>
     Notes sur l'utilisation de types SQL divers
    </title>
    <para>
     SESAM ne supporte pas le type BLOB. Une future version de
     SESAM devra le faire.
    </para>
    <para>
     L'interface PHP effectue automatiquement les conversions suivantes lors
     de la lecture de lignes de r&eacute;sultats SQL :
     <table>
      <title>Conversion de type SQL vers PHP</title>
      <tgroup cols="2">
       <thead>
        <row>
 	     <entry>Type SQL</entry>
 	     <entry>Type PHP</entry>
        </row>
       </thead>
       <tbody>
        <row>
 	     <entry>SMALLINT, INTEGER</entry>
 	     <entry>"integer" (entier)</entry>
        </row>
        <row>
 	     <entry>NUMERIC, DECIMAL, FLOAT, REAL, DOUBLE</entry>
 	     <entry>"double" (nombre &agrave; virgule flottante)</entry>
        </row>
        <row>
 	     <entry>DATE, TIME, TIMESTAMP</entry>
 	     <entry>"string"(cha&icirc;ne de caract&egrave;res)</entry>
        </row>
        <row>
 	     <entry>VARCHAR, CHARACTER</entry>
 	     <entry>"string"(cha&icirc;ne de caract&egrave;res)</entry>
        </row>
       </tbody>
      </tgroup>
     </table>
     Lorsque vous lisez une ligne enti&egrave;re, le r&eacute;sultat est retourn&eacute;
     sous la forme d'un tableau. Les champs vides ne sont pas remplis,
     et vous aurez &agrave; v&eacute;rifier vous m&ecirc;me l'existence des champs (
     (utilisez <function>isset</function> ou <function>empty</function>
     pour tester les champs vides). Cela donne plus de contr&ocirc;le &agrave;
     l'utilisateur sur l'apparence des champs que si les champs
     vides &eacute;taient repr&eacute;sent&eacute; par des cha&icirc;nes vides).
    </para>
   </note>
   <note>
    <title>Support des "champs multiples" de SESAM</title>
    <para>
     La fonctionnalit&eacute; sp&eacute;ciale des "champs multiples" de SESAM permet
     &agrave; une colonne de contenir un tableau de champs. Un tel "champs multiple"
     peut &ecirc;tre cr&eacute;&eacute; comme ceci :
     <example>
      <title>Cr&eacute;ation d'une colonne de champs multiples</title>
      <programlisting role="sesam">
CREATE TABLE multi_field_test
(
     pkey  CHAR(20) PRIMARY KEY,
     multi(3)   CHAR(12)
)
      </programlisting>
     </example>
     et peut &ecirc;tre remplie avec :
     <example>
      <title>Affectation d'une colonne de type "champs multiple"</title>
      <programlisting role="sesam">
INSERT INTO multi_field_test ( pkey, multi(2..3) )
  VALUES ( 'Second', &lt;'first_val','second_val&gt;)
      </programlisting>
     </example>
     Notez que (comme c'est le cas ci-dessus), les sous-champs vides
     initiaux sont ignor&eacute;s, et que le tableau est alors compact&eacute;, ce qui
     fait que l'exemple ci-dessus conduit &agrave; un tableau multi(1..2) au
     lieu de multi(2..3).
    </para>
    <para>
     Lors de la lecture d'une ligne, les "champs multiples" sont mis en colonne.
     Dans l'exemple ci-dessu, "pkey" prend l'index 0, et les trois colonnes
     "multi(1..3)" sont accessibles depuis les index 1 &agrave; 3.
    </para>
   </note>
   <para>
    Pour de plus amples d&eacute;tails sur SESAM, reportez vous &agrave; la
    documentation <ulink url="&url.sesam.en;">SESAM/SQL-Server</ulink> en anglais
    ou <ulink url="&url.sesam.de;">SESAM/SQL-Server</ulink> en allemand,
    disponibles toutes deux en ligne, ou en manuels.
   </para>
  </partintro>

&reference.sesam.functions;

 </reference>
<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
-->

