<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.3 $ -->
<!-- splitted from ./en/functions/ldap.xml, last change in rev 1.17 -->
  <refentry id="function.ldap-search">
   <refnamediv>
    <refname>ldap_search</refname>
    <refpurpose>Recherche sur le serveur LDAP</refpurpose>
   </refnamediv>
   <refsect1>
    <title>Description</title>
     <methodsynopsis>
      <type>resource</type><methodname>ldap_search</methodname>
      <methodparam><type>resource</type><parameter>link_identifier</parameter></methodparam>
      <methodparam><type>string</type><parameter>base_dn</parameter></methodparam>
      <methodparam><type>string</type><parameter>filter</parameter></methodparam>
      <methodparam choice="opt"><type>array</type><parameter>attributes</parameter></methodparam>
      <methodparam choice="opt"><type>int</type><parameter>attrsonly</parameter></methodparam>
      <methodparam choice="opt"><type>int</type><parameter>sizelimit</parameter></methodparam>
      <methodparam choice="opt"><type>int</type><parameter>timelimit</parameter></methodparam>
      <methodparam choice="opt"><type>int</type><parameter>deref</parameter></methodparam>
     </methodsynopsis>
    <para>
     <methodname>ldap_search</methodname> retourne un identifiant de r&eacute;sultat,
     ou bien &false; en cas d'erreur.
    </para>
    <para>  
     <function>ldap_search</function> effectue une recherche avec le 
     filtre <parameter>filter</parameter> dans le dossier
     <parameter>base_dn</parameter> avec le param&eacute;trage
     <constant>LDAP_SCOPE_SUBTREE</constant>.  C'est l'&eacute;quivalent 
     d'une recherche dans le dossier. <parameter>base_dn</parameter> 
     sp&eacute;cifie le DN de base du dossier.
    </para>
    <para>
     Il y a un quatri&egrave;me param&egrave;tre optionnel, qui peut &ecirc;tre fourni pour
     restreindre les attributs et valeurs retourn&eacute;es par le serveur,
     afin de les adapter &agrave; vos besoins. C'est bien plus efficace que
     le comportement par d&eacute;faut (qui retourne tous les attributs et leurs
     valeurs associ&eacute;es). L'utilisation de ce quatri&egrave;me est donc vivement
     recommand&eacute;.
    </para>
    <para>
     Le quatri&egrave;me paramt&egrave;re est un tableau de cha&icirc;nes PHP avec
     les attributs demand&eacute;, comme par exemple : 
     <literal>array("mail","sn","cn")</literal>. Notez que le
     <literal>"dn"</literal> est toujours retourn&eacute;, ind&eacute;pendamment
     des attributs demand&eacute;s.
    </para>
    <para>
     Notez aussi que certains serveurs de dossiers sont configur&eacute;s pour 
     retourner un nombre limit&eacute; d'entr&eacute;es. Si
     cette situation survient, le serveur indiquera qu'il a retourn&eacute; un
     r&eacute;sultat partiel. C'est aussi le cas si le sixi&egrave;me param&egrave;tre 
     <parameter>sizelimit</parameter> a &eacute;t&eacute; utilis&eacute; pour limiter le nombre
     d'entr&eacute;es retourn&eacute;es.
    </para> 
    <para>
     Le cinqui&egrave;me param&egrave;tre <parameter>attrsonly</parameter> doit &ecirc;tre
     mis &agrave; 1 si seul les types d'attributs sont d&eacute;sir&eacute;s. Si ce param&egrave;tre
     est mis &agrave; 0, les types d'attributs et leurs valeurs seront retourn&eacute;es : 
     c'est le comportement par d&eacute;faut.
    </para> 
    <para>
     Avec le sixi&egrave;me param&egrave;tre <parameter>sizelimit</parameter>, il est possible
     de limiter le nombre d'entr&eacute;es lues dans le r&eacute;sultat. En utilisant 0, on
     indique qu'il n'y a pas de limite.
     NOTE : ce param&egrave;tre NE peut PAS remplacer la configuration du serveur.
     Vous pouvez au mieux baisser encore cette limite.
    </para> 
    <para>
     Le septi&egrave;me param&egrave;tre <parameter>timelimit</parameter> permet de sp&eacute;cifier
     le nombre de secondes de dur&eacute;ee de la recherche. En utilisant la valeur
     0, la recherche pourra dur&eacute;e ind&eacute;finiment. 
     NOTE : ce param&egrave;tre NE peut PAS remplacer la configuration du serveur.
     Vous pouvez au mieux baisser encore cette limite.
    </para> 
    <para>
     Le huiti&egrave;me param&egrave;tre <parameter>deref</parameter> sp&eacute;cifie comment les
     alias doivent &ecirc;tre g&eacute;r&eacute; durant la recherche&eacute;. Ce param&egrave;tre peut prendre
     l'une des valeurs suivantes : 
     <itemizedlist>
     <listitem>
      <simpara>
       LDAP_DEREF_NEVER - (par d&eacute;faut) les alias ne sont jamais d&eacute;r&eacute;f&eacute;renc&eacute;s.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       LDAP_DEREF_SEARCHING - les alias sont d&eacute;r&eacute;f&eacute;renc&eacute;s durant la recherche,
       mais pas durant la localisation du dossier de recherche.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       LDAP_DEREF_FINDING - les alias sont d&eacute;r&eacute;f&eacute;renc&eacute;s durant la localisation
       du dossier de recherche, mais pas durant la recherche.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       LDAP_DEREF_ALWAYS - les alias sont toujours d&eacute;r&eacute;f&eacute;renc&eacute;s.
      </simpara>
     </listitem>
     </itemizedlist>
    </para>  
    <note>
     <para>
      Ces param&egrave;tres optionnels ont &eacute;t&eacute; ajout&eacute;s en 4.0.2 :
      <parameter>attrsonly</parameter>,
      <parameter>sizelimit</parameter>,
      <parameter>timelimit</parameter> et 
      <parameter>deref</parameter>.
     </para>
    </note>
    <para>
     Le filtre de recherche peut &ecirc;tre simple ou avanc&eacute;, et utiliser ces 
     op&eacute;rateurs bool&eacute;en au format d&eacute;crit dans la documentation LDAP 
     (reportez vous &agrave; <ulink url="&url.ldap.filters;">Netscape Directory SDK</ulink>
     pour plus d'informations sur les filtres).
    </para>
    <para>
     L'exemple ci-dessous lit le nom du service, le nom, le pr&eacute;nom et le 
     email des employ&eacute;s de la soci&eacute;t&eacute; "Ma Compagnie", dont le nom ou
     le pr&eacute;nom contient la sous cha&icirc;ne : $person. Cet exemple illustre
     l'utilisation de filtres pour indiquer au serveur de faire une 
     recherche sur deux attributs.
     <example>
      <title>Recherche LDAP</title>
<programlisting role="php">
<![CDATA[
<?php
// $ds doit &ecirc;tre une ressource de connexion valide

// $person est un nom ou une partie de nom (par exemple, "Jean")

$dn = "o=Ma Compagnie, c=FR";
$filter="(|(sn=$person*)(givenname=$person*))";
$justthese = array( "ou", "sn", "givenname", "mail");

$sr=ldap_search($ds, $dn, $filter, $justthese);

$info = ldap_get_entries($ds, $sr);

print $info["count"]." entr&eacute;es trouv&eacute;es.<p>";
?>
]]>
</programlisting>
      </example></para>
    <para>
     Depuis PHP 4.0.5, il est possible de faire des recherches paralelles. Pour cela,
     vous devez utiliser un tableau de ressources de connexion comme premier argument,
     au lieu d'une ressource simple. Si vous ne voulez pas utiliser le m&ecirc;me
     dossier de base DN et le m&ecirc;me filtre pour toutes les recherches, 
     vous pouvez aussi utiliser un tableau de DN et de filtres. Ces
     tableaux doivent alors etre de la m&ecirc;me taille que le table de
     ressources de connexion : la premi&egrave;re entr&eacute;e du tableau de ressources
     sera utilis&eacute; avec le premier DN et le premier filtre, etc...
     Lorsque vous faite une recherche paralelle, un tableau de r&eacute;sultats
     est retourn&eacute;, sauf en cas d'erreur, auquel cas l'entr&eacute;e contiendra
     &false;. C'est tr&egrave;s proche du comportement habituel, hormis le fait
     qu'un r&eacute;sultat est toujours retourn&eacute; lorsqu'une recherche est faite.
     Il y a de rares cas où une recherche retourne &false;, alors qu'une
     recherche en paralelle retourne un identifiant.
    </para>
   </refsect1>
  </refentry>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
