<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.2 $ -->
  <sect1 id="install.windows">
  <title>Installation sous Windows</title>
  <para>
   Cette section s'applique aux syst&egrave;mes Windows 95/98/Me et
   Windows NT/2000/XP. (La configuration n'est actuellement pas confirm&eacute;e
   sous XP). Ne vous attendez pas &agrave; ce que PHP fonctionne sur les
   plateformes 16 bits, comme Windows 3.1. Parfois, on d&eacute;crira les
   plateformes support&eacute;es sous le nom de Win32.
   </para>
 <para>
  Il y a deux m&eacute;thodes principales pour installer PHP sous Windows :
  soit <link linkend="install.windows.manual">manuellement</link>,
  soit avec <link linkend="install.windows.installer">InstallShield</link>.
 </para>
 <para>
  Si vous avez Microsoft Visual Studio, vous pouvez aussi
  <link linkend="install.windows.build">compiler</link>
  PHP &agrave; partir des sources.
 </para>
 <para>
  Une fois que PHP est install&eacute; sur votre Windows, vous pouvez aussi
  ajouter diverses
  <link linkend="install.windows.extensions">extensions</link>.
 </para>
   
 <sect2 id="install.windows.installer">
 <title>InstallShield sous Windows</title>
 <para>
  L'installeur Windows de PHP disponible depuis les pages de
  <ulink url="&url.php.downloads;">&url.php.downloads;</ulink>, installe la version
  CGI de PHP, et configure les serveurs web IIS, PWS, et Xitami.
  Notez bien que bien que InstallShield soit une m&eacute;thode simple
  pour installer PHP, il est limit&eacute; dans son fonctionnement, puisque
  l'installation automatique des extensions n'est pas prise en compte.
 </para>
 <simpara>
  Installez votre serveur <acronym>HTTP</acronym> favori sur votre
  syst&egrave;me et assurez-vous qu'il fonctionne.
 </simpara>
 <simpara>
  Ex&eacute;cutez l'installeur et suivez les instructions fournies par le
  wizard. Deux types d'installation sont fournis : standard, qui
  utilise toutes les configurations par d&eacute;faut les plus pratiques,
  et avanc&eacute;e, qui pose un maximum de questions pour param&eacute;trer
  le plus finement.
 </simpara>
 <simpara>
  Le wizard d'installation rassemble suffisamment d'informations pour
  configurer &php.ini; et le serveur web qui utilisera
  PHP. Pour IIS, mais aussi PWS sous NT Workstation, une liste de l'arboresence
  web est affich&eacute;e, et vous pouvez s&eacute;lectionner les dossiers
  qui utiliseront PHP.
 </simpara>


 <simpara>
  Une fois l'installation termin&eacute;e, l'installeur vous informera que
  vous devez red&eacute;marrer. Suivez ce conseil, ou commencez &agrave;
  utiliser PHP imm&eacute;diatement.
 </simpara>
 <warning>
  <para>
   Gardez bien &agrave; l'esprit que cette installation de PHP n'est pas
   s&eacute;curis&eacute;e. Si vous voulez avoir une installation s&eacute;curis&eacute;e de PHP,
   vous devriez commencer par lire la documentation, et choisir
   toutes vos options avec soin. Cet installeur automatique vous
   permet de r&eacute;aliser l'installation en un tour de main, mais n'est
   pas destin&eacute;e &agrave; l'utilisation sur des serveurs de production.
   </para>
  </warning>
   
   </sect2>
   
   <sect2 id="install.windows.manual">
   <title>Instructions G&eacute;n&eacute;rales d'installation</title>
 <simpara>
  Ce guide vous permet d'installer et de configurer manuellement
  PHP sur vos stations Windows 9x/Me/NT/2000. Vous devrez commencer
  par t&eacute;l&eacute;charger la distribution de &php; au format compress&eacute; ZIP
  &agrave; <ulink url="&url.php.downloads;">&url.php.downloads;</ulink>.
  La premi&egrave;re version de ce
  guide a &eacute;t&eacute; compil&eacute;e par &link.bob;.
  La version originale est disponible (en anglais)
  &agrave; <ulink url="&url.win32install;">&url.win32install;</ulink>.
 </simpara>
   <para>
 Ce guide fournit une aide d'installation pour :
  <itemizedlist>
   <listitem>
    <para>
     Personal Web Server (Version la plus r&eacute;cente recommand&eacute;e)
    </para>
   </listitem>
   <listitem>
    <para>
     Internet Information Server 3 ou 4
    </para>
   </listitem>
   <listitem>
    <para>
     Apache 1.3.x
    </para>
   </listitem>
   <listitem>
    <para>
     Omni HTTPd 2.0b1 et plus r&eacute;cent
    </para>
   </listitem>
   <listitem>
    <para>
     Oreilly Website Pro
    </para>
   </listitem>
   <listitem>
    <para>
     Xitami
    </para>
   </listitem>
   <listitem>
    <para>
     Netscape Enterprise Server, iPlanet
    </para>
   </listitem>
  </itemizedlist>
 </para>
   <para>
  PHP 4 pour Windows est d&eacute;clin&eacute; en deux versions : un ex&eacute;cutable
  CGI (<filename>php.exe</filename>), et plusieurs modules SAPI
  (par exemple php4isapi.dll). Cette derni&egrave;re forme est nouvelle
  pour PHP 4 et founit des performances am&eacute;lior&eacute;es ainsi que des
  fonctionnalit&eacute;s suppl&eacute;mentaires.
 </para>
    <warning>
     <simpara>
      Les modules SAPI ont &eacute;t&eacute; significativement am&eacute;lior&eacute;e en version 4.1.
      Toutes fois, vous pouvez rencontrer des erreurs de serveur ou des
      erreurs de modules tels qu'ASP, dans les anciens syst&egrave;mes.
     </simpara>
    </warning>
<para>
  Si vous choisissez l'un des modules SAPI et utilisez Windows 95,
  pensez &agrave; t&eacute;l&eacute;charger la mise &agrave; jour DCOM &agrave;
  <ulink url="&url.dcom.update;">Microsoft DCOM pages</ulink>. 
  Pour le module ISAPI, comme un serveur web
  compatible est n&eacute;cessaire (test&eacute; avec IIS 4.0, PWS 4.0 et IIS 5.0).
  IIS 3.0 <emphasis>n'est pas</emphasis> support&eacute;; vous devez
  t&eacute;l&eacute;charger et installer le Windows NT 4.0 Option Pack avec IIS 4.0 si
  vous voulez le support natif de PHP.
 </para>

<para>
  Voici les diff&eacute;rentes &eacute;tapes d'installation avant les
  &eacute;tapes sp&eacute;cifiques au serveur.
  <itemizedlist>
   <listitem>
    <para>
     Extrayez la distribution dans le dossier de votre
     choix. <filename>"C:\php\"</filename> est une bonne id&eacute;e.
    </para>
   </listitem>
   <listitem>
    <para>
     Vous devez vous assurer que les DLL que PHP utilise sont
     disponibles. La liste pr&eacute;cise des DLL d&eacute;pend du serveur
     web que vous utiliser, et de la m&eacute;thode que vous utiliser
     pour faire ex&eacute;cuter vos script (CGI ou module).
     <filename>php4ts.dll</filename> est toujours n&eacute;cessaire.
     Si vous utiliser PHP en module, (e.g. ISAPI or Apache), vous
     aurez besoin de la DLL ad hoc, dans le dossier <filename>sapi</filename>.
     Si vous utilisez des extensions PHP, vous aurez besoin des
     DLL associ&eacute;es. Pour &ecirc;tre certains que les DLL sont accessibles,
     vous pouvez les copier dans le dossier syst&egrave;me (i.e.
     <filename>winnt/system32</filename> ou
     <filename>windows/system</filename>) ou vous pouvez vous
     assurer qu'elles sont dans le m&ecirc;me dossier que l'ex&eacute;cutable
     PHP ou les autres DLL de votre serveur web (i.e. php.exe,
     ou php4apache.dll).
    </para>
    <para>
     L'ex&eacute;cutable binaire PHP, les modules SAPI, et certaines extensions
     utilisent des DLL externes. Assurez vous que ces DLL sont dans votre
     distribution, et dans un dossier qui est cit&eacute; dans le
     PATH Windows. Le mieux &agrave; faire est de copier les fichiers ci-dessous
     dans votre dossier syst&egrave;me, qui est g&eacute;n&eacute;ralement :
     <simplelist>
     <member>c:\windows\system pour Windows 9x/Me</member>
     <member>c:\winnt\system32 pour Windows NT/2000</member>
     </simplelist>
     Les fichiers &agrave; copier sont :
     <simplelist>
     <member>
     &apos;php4ts.dll&apos;, s'il existe, &eacute;crasez le
     </member>
     <member>
     Les fichiers &apos;dlls&apos; de votre distribution. Si vous les
     avez d&eacute;j&agrave; install&eacute;, ne les remplacez pas, sauf si quelquechose
     ne fonctionne pas correctement (avant de les &eacute;craser, il est
     recommand&eacute; de les sauver de toutes mani&egrave;res, au cas o&ugrave;
     quelque chose irait de travers).
     </member>
     </simplelist>
    </para>
    <para>
     T&eacute;l&eacute;chargez la derni&egrave;re version de Microsoft Data Access Components
     (MDAC) pour votre plateforme, sp&eacute;cialement si vous utilisez
     Microsoft Windows 9x/NT4. MDAC est disponible &agrave;
     <ulink url="&url.mdac;">&url.mdac;</ulink>.
    </para>
   </listitem>
    <listitem>
    <para>
     Copiez le fichier &apos;<filename>php.ini-dist</filename>&apos; dans votre dossier
     &apos;%WINDOWS%&apos; sous Windows 95/98, ou vers votre
     dossier &apos;%SYSTEMROOT%&apos; sous Windows NT ou Windows
     2000 et renommez le en &apos;&php.ini;&apos;. Votre dossier
     &apos;%WINDOWS%&apos; ou &apos;%SYSTEMROOT%&apos; est g&eacute;n&eacute;ralement :
     <simplelist>
     <member>c:\windows pour Windows 9x/Me</member>
     <member>c:\winnt ou c:\winnt40 pour les serveurs NT/2000</member>
     </simplelist>
    </para>
    <para>
     Il y a deux fichiers ini, distribu&eacute;s dans le fichier zip,
     <filename>php.ini-dist</filename> et
     <filename>php.ini-optimized</filename>. Nous vous recommandons
     d'utiliser <filename>php.ini-optimized</filename>,
     car nous l'avons optimis&eacute; d'un point de vue s&eacute;curit&eacute; et
     vitesse d'ex&eacute;cution. Le mieux est tout de m&ecirc;me de
     lire le fichier de configuration
     <link linkend="configuration.file">php.ini</link> et
     de choisir vos options manuellement. Si vous voulez atteindre
     un meilleur niveau de s&eacute;curit&eacute;, c'est par ce moyen que vous
     pourez le faire, m&ecirc;me si PHP focntionne parfaitement
     avec les configurations par d&eacute;faut.
    </para>
   </listitem>
    <listitem>
    <para>
     Editez votre fichier &php.ini; :
     <itemizedlist>
      <listitem>
       <simpara>
        Vous devez changer votre option 'extension_dir' pour qu'il
        pointe sur votre dossier d'installation PHP, ou vers l'endroit
        o&ugrave; vous avez install&eacute; vos 'php_*.dll'. ex: c:\php\extensions
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        Si vous utilisez Omni Httpd, sautez l'&eacute;tape suivante.
        Modifiez 'doc_root' pour qu'il pointe sur votre
        racine de serveur web. ex: <filename>c:\apache\htdocs</filename>
        ou <filename>c:\webroot</filename>.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        Choisissez les modules que vous voulez charger lorsque
        PHP d&eacute;marre. Voyez la
        section sur les
        <link linkend="install.windows.extensions">extensions Windows</link>,
        pour savoir comment les installer et quelles sont celles qui sont
        d&eacute;j&agrave; inclues. Notez aussi qu'il est pr&eacute;f&eacute;rable de commencer
        par faire fonctionner &php; sur une nouvelle installation avant
        d'activer des extensions suppl&eacute;mentaires avec &php.ini;.
       </simpara>
      </listitem>
         <listitem>
          <simpara>
           Sous PWS et IIS, vous pouvez configurer le fichier
           <filename>browscap.ini</filename> pour qu'il pointe sur 
           <filename>c:\windows\system\inetsrv\browscap.ini</filename> sous Windows 9x/Me,
           <filename>c:\winnt\system32\inetsrv\browscap.ini</filename> sous NT/2000 et
           <filename>c:\windows\system32\inetsrv\browscap.ini</filename> sous XP.
          </simpara>
         </listitem>
      <listitem>
       <simpara>
        Notez que le dossier <filename>mibs</filename> fourni avec
        la distribution Windows, contient des fichiers de support
        du protocole SNMP. Ce dpssier doit &ecirc;tre d&eacute;plac&eacute; dans le dossier
        <filename>DRIVE:\usr\mibs</filename> (<filename>DRIVE</filename>
        est le p&eacute;riph&eacute;rique o&ugrave; PHP est install&eacute;.)
      </simpara>
      </listitem>
         <listitem>
          <simpara>
           Si vous n'utilisez pas NTFS sous Windows NT, 2000 et XP, assurez vous
           que l'utilisateur qui fait tourner le serveur web a bien les
           permission pour acc&eacute;der &agrave; votre &php.ini;.
          </simpara>
         </listitem>
        </itemizedlist>
       </para>
      </listitem>
      <listitem>
       <para>
        Avec PWS, donnez les droits d'ex&eacute;cution au webmestre : 
        <itemizedlist>
         <listitem>
          <simpara>
           D&eacute;marrez le PWS Web Manager
          </simpara>
         </listitem>
         <listitem>
          <simpara>
           Editez les Properties du dossier "Home"
          </simpara>
         </listitem>
         <listitem>
          <simpara>
           S&eacute;lectionnez la coche "execute"
          </simpara>
         </listitem>
        </itemizedlist>
       </para>
      </listitem>
      

     </itemizedlist>
    </para>
   </sect2>

 <sect2 id="install.windows.build">
 <title>Compilation des sources</title>
 <para>
  Avant de commencer, il est bon de se poser la question suivante :
  "Pourquoi la compilation de PHP sous Windows est si difficile?".
  Deux raisons viennent imm&eacute;diatement &agrave; l'esprit :
 </para>
 <orderedlist>
  <listitem>
  <simpara>
   Windows ne dispose pas (encore) d'une grande communaut&eacute; de
   d&eacute;veloppeurs qui partagent librement leurs sources.
   La cons&eacute;quence directe est que les investissements
   n&eacute;cessaires en infrastructure pour supporter ce
   type de d&eacute;veloppement n'ont pas &eacute;t&eacute; faits. Ce qui fait
   que le portage des utilitaires Unix a &eacute;t&eacute; la solution
   pour pallier ce manque. Ne soyez donc pas surpris de
   rencontrer cette parent&eacute; de temps en temps.
   </simpara>
  </listitem>
  <listitem>
   <simpara>
   La majorit&eacute; des instructions que vous allez rencontrer sont
   du type : "faire et oublier". Alors, asseyez-vous confortablement
   et suivez aussi scrupuleusement que possible les instructions.
   </simpara>
  </listitem>
 </orderedlist>

    <sect3 id="install.windows.build.requirement">
     &reftitle.required;
     <para>
      Pour compilerl'ex&eacute;cutable &php;, vous avez besoin d'un 
      Microsoft Development Environment. Microsoft Visual C++ 6.0 est recommend&eacute;.
      Pour &eacute;xtraire le fichier t&eacute;l&eacute;charg&eacute;, vous avez besoin d'un outil
      de d&eacute;compression (e.g.: Winzip). Si vous n'avez pas encore d'utilitaire
      de d&eacute;compression, vous pouvez en t&eacute;l&eacute;charger un chez 
      <ulink url="&url.infozip;">InfoZip</ulink>.
     </para>
     <para>
      Avant de commencer, vous devez t&eacute;l&eacute;charger...
     </para>
      <itemizedlist>
       <listitem>
        <simpara>
        les win32 buildtools de &php, sur 
        <ulink url="&url.win32.buildtools;">&url.win32.buildtools;</ulink>.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        le code source du r&eacute;solveur de noms DNS utilis&eacute; par &php;
        sur <ulink url="&url.win32.dnsresolver;">&url.win32.dnsresolver;</ulink>. 
        C'est un remplacement pour la librairie <filename>resolv.lib</filename> 
        inclue dans <filename>win32build.zip</filename>.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
        Si vous pr&eacute;voyez de compiler &php; comme module pour Apache,
        vous aurez aussi besion des 
        <ulink url="&url.apache.source;">sources d'Apache</ulink>.
       </simpara>
      </listitem>
     </itemizedlist>
     <simpara>
      Finalement, vous aurez besoin des sources PHP 4 elles-m&ecirc;mes!!
      Les derni&egrave;res versions sont accessibles sur le serveur
      CVS <ulink url="&url.php.anoncvs;">anonyme</ulink>.
      Si vous t&eacute;l&eacute;chargez une version
      <ulink url="&url.php.snapshots;">interm&eacute;diaire</ulink>
      ou la <ulink url="&url.php.downloads;">source</ulink>, 
     </simpara>
    </sect3>
    <sect3 id="install.windows.build.install">
  <title>Compiler tout ensemble</title>
     <para>
      Apr&egrave;s t&eacute;l&eacute;chargement des paquets n&eacute;cessaires, vous devez les extraire
      au bon endroit.
      <itemizedlist>
       <listitem>
        <simpara>
         Cr&eacute;ez un dossier o&ugrave; tous les fichiers seront plac&eacute;s apr&egrave;s l'extraction,
         comme par exemple :<filename>c:\work</filename>.
        </simpara>
       </listitem>
       <listitem>
        <simpara>
         Cr&eacute;ez le dossier <filename>win32build</filename> dans votre dossier
         de travail (ici <filename>c:\work</filename>) et d&eacute;compressez 
         <filename>win32build.zip</filename> dedans.
        </simpara>
       </listitem>
       <listitem>
        <simpara>
         Cr&eacute;ez le dossier <filename>bindlib_w32</filename> sous votre dossier
         de travail (ici <filename>c:\work</filename>)  et d&eacute;compressez  
         <filename>bindlib_w32.zip</filename> dedans.
        </simpara>
       </listitem>
       <listitem>
        <simpara>
         D&eacute;compressez le code source de &php; dans votre dossier de travail
         (<filename>c:\work</filename>).
        </simpara>
       </listitem>
      </itemizedlist>
      Apr&egrave;s avoir suivi ces instructions, vous devriez obtenir un dossier qui ressemble &agrave;
      ceci : 
      <informalexample>
       <programlisting>
<![CDATA[

+--c:\work
|  |
|  +--bindlib_w32
|  |  |
|  |  +--arpa
|  |  |
|  |  +--conf
|  |  |
|  |  +--...
|  |
|  +--php-4.x.x
|  |  |
|  |  +--build
|  |  |
|  |  +--...
|  |  |
|  |  +--win32
|  |  |
|  |  +--...
|  |
|  +--win32build
|  |  |
|  |  +--bin
|  |  |
|  |  +--include
|  |  |
|  |  +--lib

]]>
       </programlisting>
      </informalexample>
      Cr&eacute;ez les dossiers <filename>c:\usr\local\lib</filename>. Copiez 
      le fichier <filename>bison.simple</filename> depuis 
      <filename>c:\work\win32build\bin</filename> vers <filename>c:\usr\local\lib</filename>.
     </para>
     <note>
      <simpara>
       Les utilisateurs de <ulink url="&url.cygwin;">Cygwin</ulink> peuvent omettre la
       derni&egrave;re &eacute;table. Un environnement Cygwin correctement install&eacute; fournit les
       fichiers obligatoires de <filename>bison.simple</filename> et
       <filename>bison.exe</filename>.
      </simpara>
     </note>
    </sect3>
    <sect3 id="install.windows.build.configure">
     <title>Configuration de MVC ++</title>
      <para>
          Lancez Microsoft Visual C++, et allez dans le menu
    "select Tools =&gt; Options". Dans le dialogue, s&eacute;lectionnez
    l'onglet "directories". Modifiez les valeurs pour les items
    du menu Executables, Includes et Library files. Votre configuration
    doit alors ressembler &agrave; 
       <itemizedlist>
        <listitem>
         <simpara>
          Fichiers &eacute;x&eacute;cutables : <filename>c:\work\win32build\bin</filename>,
          Utilisateurs Cygwin : <filename>cygwin\bin</filename>
         </simpara>
        </listitem>
        <listitem>
         <simpara>
          Fichiers include: <filename>c:\work\win32build\include</filename>
         </simpara>
        </listitem>
         <listitem>
          <simpara>
          Fichiers library : <filename>c:\work\win32build\lib</filename>
         </simpara>
        </listitem>
       </itemizedlist>
      </para>
    </sect3>

    <sect3 id="install.windows.build.resolvlib">
     <title>Compilation de resolv.lib</title>
      <para>
       Vous devez compiler la librairie <filename>resolv.lib</filename>.
       Decidez si vous avez besoin des symboles de d&eacute;bogage
       (bindlib - Win32 Debug) ou non (bindlib - Win32 Release).
       Compilez la configuration ad hoc : 
       <itemizedlist>
        <listitem>
         <simpara>
      Pour les utilisateurs de l'interface graphique, lancez VC++, puis s&eacute;lectionnez le
      menu "File =&gt; Open Workspace" et "bindlib".  Puis s&eacute;lectionnez
      "Build=&gt;Set Active Configuration" et s&eacute;lectionnez la configuration
      voulue. Enfin, s&eacute;lectionnez "Build=&gt;Rebuild All".
         </simpara>
        </listitem>
        <listitem>
         <simpara>
      Pour les utilisateurs en ligne de commande, assurez-vous que
      vous avez enregistr&eacute; les variables d'environnement C++, ou que
      vous avez ex&eacute;cut&eacute; <command>vcvars.bat</command>. Ex&eacute;cutez
      maintenant l'une des commandes suivantes :
         </simpara>
         <itemizedlist>
          <listitem>
           <simpara>
            <userinput>msdev bindlib.dsp /MAKE "bindlib - Win32 Debug"</userinput>
           </simpara>
          </listitem>
          <listitem>
           <simpara>
            <userinput>msdev bindlib.dsp /MAKE "bindlib - Win32 Release"</userinput>
           </simpara>
          </listitem>
         </itemizedlist>
        </listitem>
       </itemizedlist>
      A ce stade, vous avez une librairie <filename>resolv.lib</filename>
      utilisable, soit dans votre dossier <filename>Debug</filename>,
      soit sans le dossier <filename>Release</filename>. Copiez ce fichier
      dans votre dossier <filename>win32build\lib</filename>, en rempla&ccedil;ant
      le fichier du m&ecirc;me nom.
      </para>
    </sect3>

    <sect3 id="install.windows.build.compile">
<title>Compilation</title>
 <simpara>
  La meilleure fa&ccedil;on de compiler est de commander par la version
  CGI/ex&eacute;cutable.
 </simpara>
 <itemizedlist>
  <listitem>
   <simpara>
    Pour les utilisateurs GUI, lancez VC++, puis s&eacute;lectionnez le
    menu "File =&gt; Open Workspace" et s&eacute;lectionnez "php4ts". Ensuite,
    s&eacute;lectionnez le menu "Build=&gt;Set Active Configuration",
    et s&eacute;lectionnez la configuration voulue. Finalement,
    s&eacute;lectionnez le menu "Build=&gt;Rebuild All".
   </simpara></listitem>
   <listitem>
    <simpara>
     Pour les utilisateurs en ligne de commande, assurez-vous que
     vous avez enregistr&eacute; les variables d'environnement C++, ou que
     vous avez ex&eacute;cut&eacute; <command>vcvars.bat</command>. Ex&eacute;cutez
     maintenant l'une des commandes suivantes :
    </simpara>
    <itemizedlist>
     <listitem><simpara>
      <userinput>msdev php4ts.dsp /MAKE "php4ts - Win32 Debug_TS"</userinput>
     </simpara></listitem>
     <listitem><simpara>
      <userinput>msdev php4ts.dsp /MAKE "php4ts - Win32 Release_TS"</userinput>
     </simpara></listitem>
     <listitem>
      <simpara>
       A ce stade, vous avez un ex&eacute;cutable <filename>php.exe</filename>
       utilisable, soit dans votre dossier <filename>Debug_TS</filename>
       soit sans le dossier <filename>Release_TS</filename>.
      </simpara>
     </listitem>
    </itemizedlist>
   </listitem>
  </itemizedlist>
     <simpara>
      Il est possible de faire des modifications particuli&egrave;res mineures
      en &eacute;ditant le fichier <filename>main/config.win32.h.in</filename>.
     </simpara>
     <simpara>
      Ensuite, vous pouvez compiler la version CLI qui est con&ccedil;ue pour un
      usage en <link linkend="features.commandline">ligne de commande</link>.
      Les &eacute;tapes sont les m&ecirc;mes que pour la compilation en mode CGI, hormis
      le fait que vous devez s&eacute;lectionner <literal>php4ts_cli - Win32 Debug_TS</literal> ou
      <literal>php4ts_cli - Win32 Release_TS</literal> dans le fichier de proejt.
      Apr&egrave;s une compilation r&eacute;ussie, vous pouvez ex&eacute;cuter le fichier <filename>php.exe</filename>
      dans l'un des dossiers <filename>Release_TS\cli\</filename> ou
      <filename>Debug_TS\cli\</filename>.
     </simpara>
     <note>
      <simpara>
       Si vous voulez utiliser PEAR et l'installeur en ligne de commande,
       la version CLI-SAPI est obligatoire. Pour plus d'informations sur le projet 
       PEAR et l'installeur, lisez la documentation sur le site de
       <ulink url="&url.php.pear;manual/">PEAR</ulink>.
      </simpara>
     </note>
     <simpara>
      Afin de compiler le module SAPI (<filename>php4isapi.dll</filename>
      pour l'int&eacute;grer dans Microsoft IIS, vous devez utiliser la configuration
      <filename>php4isapi-whatever-config</filename> et compiler la DLL
      n&eacute;cessaire.
     </simpara>
    </sect3>
   </sect2>
   
   <sect2 id="install.windows.extensions">
    <title>Installation des extensions sous Windows</title>
  <para>
   Apr&egrave;s avoir install&eacute; PHP et votre serveur web sous Windows,
   vous voudrez s&ucirc;rement ajouter quelques extensions bien pratiques.
   La table suivante liste une partie des extensions disponibles.
   Comme indiqu&eacute; dans le manuel, vous pouvez choisir quelles
   extensions vous voulez charger en d&eacute;commentant
   la ligne 'extension=php_*.dll' dans le fichier &php.ini;.
   Vous pouvez aussi charger dynamiquement un module avec la fonction
   <function>dl</function>.
  </para>
  <para>
   Les fichiers DLLs des extensions PHP sont pr&eacute;fix&eacute;s
   par 'php_' en PHP 4, et 'php3_' en PHP 3. Cela &eacute;vite la confusion
   des extensions PHP et de leurs librairies.
  </para>
    <note>
     <para>
       En PHP 4.0.6 le support des extensions BCMath, Calendar, COM, FTP, MySQL, ODBC, PCRE, 
       Session, WDDX et XML est activ&eacute; <emphasis>par d&eacute;faut</emphasis>.
       Vous n'avez pas &agrave; charger d'extensions particuli&egrave;re pour utiliser
       ces fonctions. Lisez le fichier <filename>README.txt</filename> inclus
       dans la distribution, ou bien <filename>install.txt</filename> pour
       connaitre la liste des modules automatiquement activ&eacute;s.
     </para>
    </note>

  <note>
     <para>
      Certaines de ces extensions requi&egrave;rent des librairies DLL suppl&eacute;mentaires
      pour fonctionner correctement. Certaines d'entre elles sont disponibles
      dans la distribution. dans le dossier <filename>dlls</filename> mais
      certaines (comme Oracle (php_oci8.dll)), demandent des dlls qui ne sont
      pas dans la distribution.
     </para>
     <para>
      Copiez les dlls fournies depuis le dossier <filename>dlls</filename> dans
      votre PATH Windows. Les bons emplacements sont typiquement
      <simplelist>
       <member>c:\windows\system pour Windows 9x/Me</member>
       <member>c:\winnt\system32 pour Windows NT/2000</member>
       <member>c:\windows\system32 pour Windows XP</member>
      </simplelist>
      Si vous les avez d&eacute;j&agrave; d'install&eacute;es sur votre syst&egrave;me, ne les &eacute;crasez
      que si PHP ne fonctionne pas correctement (et de toutes mani&egrave;res, faites
      une sauvegarde de ces DLL, en cas de probl&egrave;me).
     </para>
    </note>

    <para>
     <table>
      <title>PHP Extensions</title>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Extension</entry>
         <entry>Description</entry>
         <entry>Notes</entry>
        </row>
       </thead>
                                                     
       <tbody>
  <row>
   <entry>php_bz2.dll</entry>
   <entry>Fonctions de compression <link linkend="ref.bzip2">bzip2</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_calendar.dll</entry>
   <entry>Fonctions de conversions calendaires <link linkend="ref.calendar">Calendar</link></entry>
   <entry>Disponible depuis PHP 4.0.3</entry>
  </row>
  <row>
   <entry>php_cpdf.dll</entry>
   <entry>Fonctions <link linkend="ref.cpdf">ClibPDF</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_crack.dll</entry>
   <entry>Fonctions de <link linkend="ref.crack">CrackLib</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php3_crypt.dll</entry>
   <entry>Fonctions de Crypt</entry>
   <entry>Inconnu</entry>
  </row>
  <row>
   <entry>php_ctype.dll</entry>
   <entry>Fonctions <link linkend="ref.ctype">ctype</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_curl.dll</entry>
   <entry><link linkend="ref.curl">CURL</link>, Client URL library functions</entry>
   <entry>Requiert : libeay32.dll, ssleay32.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_cybercash.dll</entry>
   <entry>Fonctions de paiement <link linkend="ref.cybercash">Cybercash</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_db.dll</entry>
   <entry>Fonctions <link linkend="ref.dbm">DBM</link></entry>
   <entry>Obsol&egrave;tes. Utilisez DBA &agrave; la place (php_dba.dll)</entry>
  </row>
  <row>
   <entry>php_dba.dll</entry>
   <entry><link linkend="ref.dba">DBA</link>: DataBase (dbm-style) Abstraction layer functions</entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_dbase.dll</entry>
   <entry>Fonctions <link linkend="ref.dbase">dBase</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php3_dbm.dll</entry>
   <entry>Fonctions Berkeley DB2</entry>
   <entry>Inconnu</entry>
  </row>
  <row>
   <entry>php_domxml.dll</entry>
   <entry>Fonctions de <link linkend="ref.domxml">DOM XML</link></entry>
   <entry>Requiert : libxml2.dll (fournie)</entry>
  </row>
  <row>
   <entry>php_dotnet.dll</entry>
   <entry>Fonctions <link linkend="ref.dotnet">.NET</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_exif.dll</entry>
   <entry>Fonctions de lecture des ent&ecirc;tes JPEG <link linkend="function.read-exif-data">Read EXIF</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_fbsql.dll</entry>
   <entry>Fonctions de <link linkend="ref.fbsql">FrontBase</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_fdf.dll</entry>
   <entry>Fonctions <link linkend="ref.fdf">FDF</link>: Forms Data Format.</entry>
   <entry>Requiert : fdftk.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_filepro.dll</entry>
   <entry>Fonctions <link linkend="ref.filepro">filePro</link></entry>
   <entry>Acc&egrave;s en lecture seule</entry>
  </row>
  <row>
   <entry>php_ftp.dll</entry>
   <entry>Fonctions <link linkend="ref.ftp">FTP</link></entry>
   <entry>Disponible depuis PHP 4.0.3</entry>
  </row>
  <row>
   <entry>php_gd.dll</entry>
   <entry>Fonctions de traitement des images <link linkend="ref.image">GD</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_gettext.dll</entry>
   <entry>Fonctions <link linkend="ref.gettext">Gettext</link></entry>
   <entry>Requiert : gnu_gettext.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_hyperwave.dll</entry>
   <entry>Fonctions <link linkend="ref.hyperwave">HyperWave</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_iconv.dll</entry>
   <entry>Fonctions de conversions de jeux de caract&egrave;res <link linkend="ref.iconv">ICONV</link></entry>
   <entry>Requiert : iconv-1.3.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_ifx.dll</entry>
   <entry>Fonctions <link linkend="ref.ifx">Informix</link></entry>
   <entry>Requiert : Informix libraries</entry>
  </row>
  <row>
   <entry>php_iisfunc.dll</entry>
   <entry>Fonctions de gestion de IIS</entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_imap.dll</entry>
   <entry>Fonctions <link linkend="ref.imap">IMAP</link>, POP3 et NNTP</entry>
   <entry>PHP 3: php3_imap4r1.dll</entry>
  </row>
  <row>
   <entry>php_ingres.dll</entry>
   <entry>Fonctions <link linkend="ref.ingres">Ingres II</link></entry>
   <entry>Requiert : Ingres II libraries</entry>
  </row>
  <row>
   <entry>php_interbase.dll</entry>
   <entry>Fonctions <link linkend="ref.ibase">InterBase</link></entry>
   <entry>Requiert : gds32.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_java.dll</entry>
   <entry>Extension <link linkend="ref.java">Java</link></entry>
   <entry>Requiert : jvm.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_ldap.dll</entry>
   <entry>Fonctions <link linkend="ref.ldap">LDAP</link></entry>
   <entry>Requiert : libsasl.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_mhash.dll</entry>
   <entry>Fonctions <link linkend="ref.mhash">Mhash</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_ming.dll</entry>
   <entry>Fonctions de g&eacute;n&eacute;rations de fichiers Flash avec <link linkend="ref.ming">Ming</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_msql.dll</entry>
   <entry>Fonctions de <link linkend="ref.msql">mSQL</link></entry>
   <entry>Requiert : msql.dll (fournies)</entry>
  </row>
  <row>
   <entry>php3_msql1.dll</entry>
   <entry>mSQL 1 client</entry>
   <entry>Inconnu</entry>
  </row>
  <row>
   <entry>php3_msql2.dll</entry>
   <entry>mSQL 2 client</entry>
   <entry>Inconnu</entry>
  </row>
  <row>
   <entry>php_mssql.dll</entry>
   <entry>Fonctions <link linkend="ref.mssql">MSSQL</link></entry>
   <entry>Requiert : ntwdblib.dll (fournies)</entry>
  </row>
  <row>
   <entry>php3_mysql.dll</entry>
   <entry>Fonctions <link linkend="ref.mysql">MySQL</link></entry>
   <entry>Built-in in PHP 4</entry>
  </row>
  <row>
   <entry>php3_nsmail.dll</entry>
   <entry>Fonctions de email Netscape</entry>
   <entry>Inconnu</entry>
  </row>
  <row>
   <entry>php3_oci73.dll</entry>
   <entry>Fonctions Oracle</entry>
   <entry>Inconnu</entry>
  </row>
  <row>
   <entry>php_oci8.dll</entry>
   <entry>Fonctions <link linkend="ref.oci8">Oracle 8</link></entry>
   <entry>Requiert : librairies clientes Oracle 8 </entry>
  </row>
  <row>
   <entry>php_openssl.dll</entry>
   <entry>Fonctions <link linkend="ref.openssl">OpenSSL</link></entry>
   <entry>Requiert : libeay32.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_oracle.dll</entry>
   <entry>Fonctions de <link linkend="ref.oracle">Oracle 7</link></entry>
   <entry>Requiert : librairies clientes Oracle 7</entry>
  </row>
  <row>
   <entry>php_pdf.dll</entry>
   <entry>Fonctions de <link linkend="ref.pdf">PDF</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_pgsql.dll</entry>
   <entry>Fonctions de <link linkend="ref.pgsql">PostgreSQL</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_printer.dll</entry>
   <entry>Fonctions d'<link linkend="ref.printer">impressions</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_xslt.dll</entry>
   <entry>Fonctions <link linkend="ref.xslt">XSLT</link></entry>
   <entry>Requiert : sablot.dll (fournies)</entry>
  </row>
  <row>
   <entry>php_snmp.dll</entry>
   <entry>Fonctions <link linkend="ref.snmp">SNMP</link></entry>
   <entry>NT only!</entry>
  </row>
  <row>
   <entry>php_sybase_ct.dll</entry>
   <entry>Fonctions <link linkend="ref.sybase">Sybase</link></entry>
   <entry>Requiert : librairies clientes Sybase</entry>
  </row>
  <row>
   <entry>php_yaz.dll</entry>
   <entry>Fonctions <link linkend="ref.yaz">YAZ</link></entry>
   <entry>Aucune</entry>
  </row>
  <row>
   <entry>php_zlib.dll</entry>
   <entry>Fonctions de compression <link linkend="ref.zlib">ZLib</link></entry>
   <entry>Aucune</entry>
  </row>
       </tbody>
      </tgroup>
     </table>
    </para>
   </sect2>
  </sect1>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
