<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.2 $ -->
  <sect1 id="install.hpux">
 <title>Installation sous HP-UX</title>
 <para>
  Cette section contient les notes et conseils d'installation de PHP
  sur les distributions HP-UX.
 </para>
   <example id="install.hpux.example">
    <title>
   Instructions d'installation pour HP-UX 10
    </title>
    <screen>
<![CDATA[
From: paul_mckay@clearwater-it.co.uk
04-Jan-2001 09:49

(Ces conseils sont destin&eacute;s &agrave; PHP 4.0.4 et Apache v1.3.9)
Vous voulez installer PHP et Apache sur une HP-UX 10.20?

1. Vous aurez besoin de gzip. T&eacute;l&eacute;chargez la distribution compil&eacute;e &agrave;
http://hpux.connect.org.uk/ftp/hpux/Gnu/gzip-1.2.4a/gzip-1.2.4a-sd-10.20.depot.Z,
puis d&eacute;compressez la, et utilisez swinstall pour installer.

2. Vous aurez besoin de gcc. T&eacute;l&eacute;chargez une distribution compil&eacute;e &agrave;
http://gatekeep.cs.utah.edu/ftp/hpux/Gnu/gcc-2.95.2/gcc-2.95.2-sd-10.20.depot.gz,
puis d&eacute;compressez la, et utilisez swinstall pour installer.

3. Vous aurez besoin de GNU binutils.
T&eacute;l&eacute;chargez une distribution compil&eacute;e &agrave;
http://hpux.connect.org.uk/ftp/hpux/Gnu/binutils-2.9.1/binutils-2.9.1-sd-10.20.depot.gz
, puis d&eacute;compressez la, et utilisez swinstall pour installer.

4. Vous aurez besoin de bison. T&eacute;l&eacute;chargez une distribution compil&eacute;e &agrave;
http://hpux.connect.org.uk/ftp/hpux/Gnu/bison-1.28/bison-1.28-sd-10.20.depot.gz
, puis d&eacute;compressez la, et utilisez swinstall pour installer.

5. Vous aurez besoin de flex. T&eacute;l&eacute;chargez une distribution source sur l'un
des miroirs http://www.gnu.org. Il se trouve dans le dossier non-gnu du site FTP.
T&eacute;l&eacute;chargez le fichier, d&eacute;compressez leur,
puis utilisez tar -xvf avec. Allez dans le nouveau dossier flex ainsi cr&eacute;&eacute;,
et ex&eacute;cutez la commande "./configure", puis faites un "make", puis un "make install".

Si vous avez des erreurs &agrave; cette &eacute;tape, c'est probablement par ce que gcc et
les autres ne sont pas inscrites dans votre PATH. Ajoutez les.
Maintenant, la partie d&eacute;licate.

6. T&eacute;l&eacute;chargez les sources d'Apache et de PHP.

7. D&eacute;compressez les avec gunzip puis faites "tar -xvf" avec les deux archives.
Nous devons modifier quelques fichiers avant de les compiler.

8. Premi&egrave;rement, le fichier de configuration doit &ecirc;tre modifi&eacute; car il
semble oublier qu'il est sur une machine HP-UX. Il y a des m&eacute;thodes plus
rus&eacute;es, mais le plus simple et le plus efficace est d'ajouter
    "lt_target=hpux10.20" &agrave; la ligne 47286 du script de configuration.

9. Le fichier d'Apache GuessOS doit &ecirc;tre modifi&eacute;. Sous
apache_1.3.9/src/helpers, modifier la ligne 89, en rempla&ccedil;ant
    "echo "hp${HPUXMACH}-hpux${HPUXVER}"; exit 0"
par :
    "echo "hp${HPUXMACH}-hp-hpux${HPUXVER}"; exit 0"

10. Il n'est pas possible d'installer PHP sous forme de shared object sous
HP-UX, ce qui fait que vous devez le compiler en statique. Suivez
simplement les instructions de la section Apache.

11. PHP et Apache sont maintenant compil&eacute;s correctement, mais Apache ne d&eacute;marre pas.
    Vous devez cr&eacute;er un nouvel utilisateur Apache, par exemple www, ou apache.
    Puis, modifiez les lignes 252 et 253 de conf/httpd.conf pour remplacer
    User nobody
    Group nogroup

par vos valeurs, par exemple :
    User www
    Group sys

Il n'est pas possible d'ex&eacute;cuter Apache avec l'utilisateur nobody sous
HP-UX. A partir de ce moment l&agrave;, PHP et Apache doivent fonctionner.

J'esp&egrave;re que cela aidera quelqu'un.

Paul Mckay.
]]>
  </screen>
 </example>

</sect1>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
