<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.10 $ -->

<!--
  TODO: add manual conventions section (eg. how to read
        function usage parts, what is fixed width, what is
        bold, what is linked
        
        add some tips about combining the versions (online-
        offline), and using "http://anymirror.php.net/funcname"
-->
<appendix id="about">
 <title>A propos du manuel</title>

 <sect1 id="about.formats">
  <title>Formats</title>
  <para>
   Le manuel &php; est fourni en diff&eacute;rents formats. Ces formats sont divis&eacute;s en
   deux groupes : ceux qui sont disponibles en ligne, et les t&eacute;l&eacute;chargeables.
  </para>
  <note>
   <para>
    Certains &eacute;diteurs ont fournis des versions imprim&eacute;es de ces manuels. Nous n'en
    recommandons aucune, car elles sont rapidement obsol&egrave;tes.
   </para>
  </note>
  <para>
   Vous pouvez lire le manuel en ligne sur le site <ulink url="&url.php;">&url.php;</ulink>
   et sur les nombreux miroirs. Pour un confort d'utilisation accru, il est recommand&eacute;
   d'utiliser un miroir proche de chez vous. Vous pouvez le voir en version
   HTML simple (et facilement imprimable), ou bien aux couleurs de &php;.net.
  </para>
  <para>
   Un des points forts du manuel en ligne sur la plupart des formats 
   t&eacute;l&eacute;chargeable, est l'int&eacute;gration des 
   <link linkend="about.notes">notes des utilisateurs</link>. Un inconv&eacute;nient
   &eacute;vident est que vous devez &ecirc;tre en ligne pour profiter de ces formats.
  </para>
  <para>
   Il y a de nombreux formats de manuel pour la consultation hors ligne, et 
   le format le plus appropri&eacute; d&eacute;pend de votre OS et de vos go&ucirc;ts personnels.
   Pour savoir comment le manuel est g&eacute;n&eacute;r&eacute;, lisez la section 
   <link linkend="about.generate">'Comment le manuel est g&eacute;n&eacute;r&eacute;'</link>.
  </para>
  <para>
   Le format le plus portable est le manuel au format HTML. Le manuel est fourni
   dans un format en une seule page HTML, ou comme un ensemble de fichier
   de taille r&eacute;duite (mais un bon millier de fichiers tout de m&ecirc;me). Les
   formats HTML et texte simple sont disponibles sous forme de fichiers d'archives
   compress&eacute;es avec bzip2.
  </para>
  <para>
   Un autre format populaire et portable est le format <acronym>PDF</acronym>, le plus pratique pour
   les impressions. Mais avant de lancer une telle impression, pensez bien que le
   manuel au complet faire plus de 2000 pages, et qu'il est constamment r&eacute;vis&eacute;.
  </para>
  <note>
   <para>
    Si vous n'avez pas de programme capable de lire les fichiers <acronym>PDF</acronym>, t&eacute;l&eacute;chargez
    le <productname><ulink url="&url.adobe.acrobat;">Adobe Acrobat Reader</ulink></productname>.
   </para>
  </note>
  <para>
   Pour les propri&eacute;taires de PDA Palm, deux formats Palm document et iSilo
   sont optimis&eacute;s pour cette plate-forme. Vous pouvez emporter votre <acronym>PDA</acronym> avec
   vous dans vos d&eacute;placements quotidiens, et utiliser les programmes 
   <acronym><ulink url="&url.palm.doc;">DOC</ulink></acronym> et 
   <productname><ulink url="&url.palm.isilo;">iSilo</ulink></productname>
   pour am&eacute;liorer vos connaissances de &php;, ou bien profiter de ses
   r&eacute;f&eacute;rences rapides.
  </para>
  <para>
   Pour les plates-formes Windows, le format <productname>Windows HTML Help</productname> fournit une
   version HTML du manuel, avec l'application <productname>Windows HTML Help</productname> : il int&egrave;gre
   un moteur de recherche complet, un index et des signets. De nombreux
   IDE sous Windows fournissent des liens avec ce format pour une meilleure
   int&eacute;gration.
  </para>
<!--  
<note>
   <para>
    Un projet de Visual Basic pour Linux a d&eacute;but&eacute;, et il incluera un cr&eacute;ateur
    de format CHM Creator et Viewer for Linux. Voyez leur 
    <ulink url="&url.vb4linux;">page SourceForge.net</ulink> si ce projet
    vous interesse.
   </para>
  </note>
  -->
 </sect1>
 
 <sect1 id="about.notes">
  <title>A propos des notes utilisateurs</title>
  <para>
   Les notes des utilisateurs jouent un r&ocirc;le tr&egrave;s important dans le 
   d&eacute;veloppement de ce manuel. En permettant aux lecteurs de contribuer par des exemples,
   des remarques et critiques, ou encore des clarifications, nous int&eacute;grons
   des aspects tr&egrave;s importants du langage dans le manuel. Jusqu'&agrave; ce que
   les notes les plus importantes soient int&eacute;gr&eacute;es dans la documentation,
   elles sont disponibles sur le site lui m&ecirc;me, et dans certains formats
   hors ligne.
  </para>
  <note>
   <para>
    Les notes des utilisateurs ne sont pas mod&eacute;r&eacute;es avant d'appara&icirc;tre sur le site,
    et m&ecirc;me si elles sont mod&eacute;r&eacute;es, leur v&eacute;racit&eacute; ne peut &ecirc;tre garantie, pas
    plus qu'il n'existe de garantie quand &agrave; l'exactitude du manuel lui-m&ecirc;me.
   </para>
  </note>
 </sect1>


 <sect1 id="about.prototypes">
   <title>Comment lire la d&eacute;finition d'une fonction (prototype)</title>
   <para>
    Chaque fonction est document&eacute;e pour permettre un acc&egrave;s rapide,
    et savoir d&eacute;coder le manuel rendra votre lecture plus facile. Plut&ocirc;t
    que de d&eacute;pendre d'exemples pr&ecirc;ts en copier/coller, il est mieux de
    savoir lire la d&eacute;finition d'une fonction. Voici comment : 
   </para>
   <note>
    <title>
     Pr&eacute;-requis : Connaissances de bases des <link linkend="language.types">types</link>.
    </title>
    <para>
     Bien que &php; soit un langage sans typage fort, une connaissance
     de base des <link linkend="language.types">types</link> est essentielle,
     car ils ont quand m&ecirc;me des sens importants.
    </para>
   </note>
   <para>
    Les d&eacute;finitions de fonctions vous indiquent quel type de donn&eacute;es est 
    <link linkend="functions.returning-values">retourn&eacute;</link>. Examinons
    la fonction <function>strlen</function> comme exemple : 
   </para>
   <para>
    <screen role="html">
strlen

PHP 3, PHP 4 

int strlen ( string  str ) 

strlen retourne la taille de la cha&icirc;ne str . 
    </screen>
   </para>
   <para>
    <table>
     <title>Explications de la d&eacute;finition de la fonction</title>
      <tgroup cols="2">
       <thead>
        <row>
         <entry>Partie</entry>
         <entry>Description</entry>
        </row>
       </thead>
       <tbody>
        <row>
         <entry>
          strlen
         </entry>
         <entry>
          Le nom de la fonction.
         </entry>
        </row>
        <row>
         <entry>
          (&php; 3, &php; 4)
         </entry>
         <entry>
          strlen() est pr&eacute;sente dans toutes les versions de &php; 3 et &php; 4.
         </entry>
        </row>
        <row>
         <entry>
          int
         </entry>
         <entry>
          Type de valeur retourn&eacute; par cette fonction, qui est en l'occurrence
          un &integer; (i.e. la taille d'une cha&icirc;ne est mesur&eacute;e par un nombre).
         </entry>
        </row>
        <row>
         <entry>
          ( string str )
         </entry>
         <entry>
          Le premier (et ici le seul) param&egrave;tre &agrave; fournir &agrave; strlen est le param&egrave;tre
          <parameter>str</parameter>, qui doit &ecirc;tre du type  &string;.
         </entry>
        </row>
       </tbody>
      </tgroup>
     </table>
    </para>
    <para>
     Nous pourrions r&eacute;&eacute;crire ce prototype avec une version plus g&eacute;n&eacute;rique : 
    </para>
    <para>
     <screen role="html">
      type_retourn&eacute;   nom_de_la fonction    ( type_du_param&egrave;tre nom_du_param&egrave;tre )
     </screen>
    </para>
    <para>
     Plusieurs fonctions ont besoin de plusieurs param&egrave;tres, comme par exemple <function>in_array</function>.
     Son prototype est le suivant : 
    </para>
    <para>
     <screen role="html">    
      bool in_array ( mixed needle, array haystack [, bool strict])
     </screen>
    </para>
    <para>
     Qu'est ce que cela signifie? <function>in_array</function> retourne
     un &boolean; &true; en cas de r&eacute;ussite ( le param&egrave;tre 
     <parameter>needle</parameter> a &eacute;t&eacute; trouv&eacute; dans le tableau 
     <parameter>haystack</parameter>) ou &false; en cas d'&eacute;chec 
     ( le param&egrave;tre <parameter>needle</parameter> n'a pas &eacute;t&eacute; trouv&eacute; 
     dans le tableau <parameter>haystack</parameter>). Le premier
     param&egrave;tre s'appelle <parameter>needle</parameter> et il peut &ecirc;tre
     de diff&eacute;rents <link linkend="language.types">types</link> : il porte
     donc la mention <emphasis><literal>mixed</literal></emphasis>. 
     Le param&egrave;tre <parameter>needle</parameter> (ce que nous recherchons) 
     peut &ecirc;tre une valeur scalaire ( &string;, &integer;, ou &float;), ou encore un &array;.  
     <parameter>haystack</parameter> (le &array; dans lequel nous recherchons) est
     le second param&egrave;tre. Le troisi&egrave;me param&egrave;tre, <parameter>strict</parameter>, 
     est optionnel. Tous les param&egrave;tres optionnels sont plac&eacute;s entre crochets.
     La manuel indique que le param&egrave;tre <parameter>strict</parameter> vaut par d&eacute;faut
     &false;.  Reportez-vous au manuel de chaque fonction pour savoir comment elle fonctionne.
    </para>
 </sect1>
 
 <sect1 id="about.phpversions">
  <title>Versions de &php; document&eacute;es dans ce manuel</title>
  <para>
   Cette documentation contient des informations sur &php; 4, avec
   des notes compatibilit&eacute;s et de migration depuis &php; 3. Le comportement,
   les param&egrave;tres, les valeurs retourn&eacute;es, etc... qui ont chang&eacute; entre
   deux versions du manuel &php; sont document&eacute;es dans les notes utilisateurs,
   et dans le manuel lui m&ecirc;me.
  </para>
  <para>
   Vous pouvez trouvez des portions de documentation destin&eacute;es aux
   versions CVS de &php;, ce qui signifie que les toutes derni&egrave;res versions
   de d&eacute;veloppement de &php; proposent ces fonctionnalit&eacute;s. Si vous n'&ecirc;tes
   pas un d&eacute;veloppeur &php;, et que vous n'avez pas la possibilit&eacute; d'utiliser
   la derni&egrave;re version de &php;, les fonctionnalit&eacute;s indiqu&eacute;es comme
   "disponibles uniquement en CVS" ne vous seront pas accessibles. Toutefois,
   ces fonctionnalit&eacute;s seront surement disponible dans la prochaine version
   stable de &php;. Si vous voulez obtenir une version des derniers sources
   de &php;, passez par <ulink url="&url.php.anoncvs;">le serveur CVS anonyme</ulink>.
  </para>
  <para>
   Vous pouvez aussi rencontrer de la documentation qui est disponible pour
   une version de &php; qui n'est pas encore publi&eacute;e (par exemple, des fonctions
   destin&eacute;es &agrave; la version &php; 4.3.0, alors que la version publique actuelle
   est &php; 4.2.3). La plupart du temps, ce n'est pas une erreur de documentation,
   mais une indication sur les fonctionnalit&eacute;s qui seront disponible avec la
   prochaine publication de &php;.
  </para>
 </sect1>
 
 <sect1 id="about.more">
  <title>O&ugrave; trouver plus d'informations sur &php;?</title>
  <para>
   Ce manuel n'a pas pour objectif de fournir des pr&eacute;sentations sur les 
   pratiques de programmation. Si vous &ecirc;tre un n&eacute;ophyte total, ou m&ecirc;me
   un programmeur d&eacute;butant, vous pouvez trouver difficile d'apprendre
   la programmation &php; avec uniquement ce manuel : il serait mieux de trouver
   des ressources plus orient&eacute;e vers l'apprentissage. Vous pouvez aussi
   trouver une liste des livres traitant de &php; sur 
   <ulink url="&url.php.books;">&url.php.books;</ulink>.
  </para>
  <para>
   Il y a un bon nombre de listes de diffusion actives, traitant de tous les
   aspects du langage et de la programmation pHP. Si vous &ecirc;tes bloqu&eacute; par un 
   probl&egrave;me, vous pourrez surement trouver de l'aide aupr&egrave;s de ces listes. 
   Il existe un recensement des listes de diffusion 
   &agrave; l'URL <ulink url="&url.php.support;">&url.php.support;</ulink>, ainsi
   qu'une liste d'archives, et de ressources de support en ligne. De plus,
   &agrave; <ulink url="&url.php.links;">&url.php.links;</ulink>, il y a une liste
   de sites web d&eacute;di&eacute;s &agrave; &php;, avec des articles, des forum, des biblioth&egrave;ques
   de code.
  </para>
 </sect1>

 <sect1 id="about.howtohelp">
  <title>Comment aider &agrave; l'am&eacute;lioration de la documentation</title>
  <para>
   Il y a trois fa&ccedil;on de participer &agrave; l'am&eacute;lioration de la documentation.
  </para>
  <para>
   Si vous trouvez des erreurs, dans n'importe quelle traduction de la documentation
   utiliser le syst&egrave;me de rapport de bugs : <ulink url="&url.php.bugs;">&url.php.bugs;</ulink>.
   Classez le rapport sous la cat&eacute;gorie <literal>"Documentation Problem"</literal>. 
   Vous pouvez aussi poster vos probl&egrave;mes ici m&ecirc;me.
  </para>
  <note>
   <para>
    N'abusez pas du syst&egrave;me de bugs pour envoyer des demandes d'aide. Utilisez
    les listes de diffusion ou les sites de communaut&eacute;, tels que mentionn&eacute;s
    ci-dessus.
   </para>
  </note>
  <para>
   En contribuant aux notes, vous pouvez fournir de nouveaux exemples,
   mettre en lumi&egrave;re des effets de bords ou apporter des clarifications pour
   les autres lecteurs. Mais ne prenez pas le syst&egrave;me d'annotation pour 
   un syst&egrave;me de soumission de bugs. Vous pouvez en savoir plus sur les
   annotations dans la section 
   <link linkend="about.notes">'A propos des notes d'utilisateurs'</link>
  </para>
  <para>
    Si vous connaissez l'anglais et une autre langue, vous pouvez aussi
    contribuer en participant &agrave; la traduction. Si vous voulez d&eacute;marrer
    une nouvelle traduction, ou participer au projet, alors commencez
    par lire <ulink url="&url.php.dochowto;">&url.php.dochowto;</ulink>.
  </para>
 </sect1>
 
 <sect1 id="about.generate">
  <title>Comment sont g&eacute;n&eacute;r&eacute;es les documentations</title>
  <para>
   Ce manuel est &eacute;crit en <acronym>XML</acronym>, en utilisant
   <ulink url="&url.docbook.xml;">la DTD de DocBook XML</ulink>, et
   <ulink url="&url.dsssl;"><acronym>DSSSL</acronym></ulink> 
   (<literal>Document Style and Semantics Specification Language</literal>) pour le format,
   et aussi, exp&eacute;rimentalement, 
   <ulink url="&url.xslt;"><acronym>XSLT</acronym></ulink> 
   (<literal>eXtensible Stylesheet Language Transformations</literal>)
   pour les maintenances et les formats.
  </para>
  <para>
   Gr&acirc;ce au format <acronym>XML</acronym> comme source, nous avons
   la possibilit&eacute; de g&eacute;n&eacute;rer de nombreux formats tout en ayant une
   seule source pour tous les formats. Les outils utilis&eacute;s pour 
   formater les versions <acronym>HTML</acronym> et
   <acronym>TeX</acronym> sont <ulink url="&url.jade;">Jade</ulink>, 
   &eacute;crit par <ulink url="&url.jclark;">James Clark</ulink> et 
   <ulink url="&url.dbstyle;">The Modular DocBook Stylesheets</ulink>
   &eacute;crit par <ulink url="&url.nwalsh;">Norman Walsh</ulink>.
   Nous utilisons <productname><ulink url="&url.winhelp;">Microsoft HTML Help Workshop</ulink></productname>
   pour g&eacute;n&eacute;rer le format <productname>Windows HTML Help</productname> format du manuel,
   et bien sur, &php; lui-m&ecirc;me pour r&eacute;aliser certaines conversions
   et formats.
  </para>
  <para>
   Vous pouvez t&eacute;l&eacute;charger le manuel dans diff&eacute;rentes langues, y compris
   un format en texte plein, <acronym>HTML</acronym>,
   <acronym>PDF</acronym>, <productname>PalmPilot DOC</productname>, 
   <productname>PalmPilot iSilo</productname> et
   <productname>Windows HTML Help</productname>, &agrave; l'URL 
   <ulink url="&url.php.docs;">&url.php.docs;</ulink>.
   Les manuels sont mis &agrave; jours automatiquement, avec la mise &agrave;
   jour des sources.
  </para>
  <para>
   Vous pouvez trouver plus d'informations sur le t&eacute;l&eacute;chargement des
   sources <acronym>XML</acronym> de cette documentation &agrave; 
   <ulink url="&url.php.cvs;">&url.php.cvs;</ulink>. La documentation
   est stock&eacute;e dans le module <literal>phpdoc</literal>.
  </para>
 </sect1>

 <sect1 id="about.translations">
  <title>Traductions</title>
  <para>
   La manuel &php; est disponible non seulement en anglais, mais aussi dans
   diff&eacute;rentes langues. Le texte du manuel est &eacute;crit d'abord en anglais, puis
   des &eacute;quipes &agrave; travers le monde, assure la traduction du manuel dans leur
   langue natale. Si la traduction d'une section n'est pas encore disponible,
   le syst&egrave;me de cr&eacute;ation de la documentation pr&eacute;sentera 
   alors la version anglaise.
  </para>
  <para>
   Les contributeurs aux documentations partent des codes sources 
   <acronym>XML</acronym> disponibles sur le CVS <ulink url="&url.php.cvs;">&url.php.cvs;</ulink>
   puis traduisent dans leur langue. Ils <emphasis>n'utilisent pas</emphasis> 
   le format <acronym>HTML</acronym>, le texte plein, ou encore le format
   <acronym>PDF</acronym>. C'est le syst&egrave;me d'&eacute;dition qui se charge de faire les conversions
   du format <acronym>XML</acronym> vers un format lisible.
  </para>
  <note>
   <para>
    Si vous voulez d&eacute;marrer une nouvelle e traduction dans votre langue, entrez en
    contact avec l'&eacute;quipe de documentation en vous inscrivant &agrave; la liste de diffusion :
    <ulink url="mailto:&email.php.doc.subscribe;">&email.php.doc.subscribe;</ulink>.
    L'adresse de la liste de diffusion est <literal>&email.php.doc;</literal>. 
    Indiquez dans le message que vous &ecirc;tes int&eacute;ress&eacute; pour traduire la documentation
    dans une nouvelle langue, et quelqu'un viendra vous aider &agrave; d&eacute;marrer un nouveau
    site de traduction, ou rejoindre l'&eacute;quipe qui a pris en charge cette 
    traduction.
   </para>    
  </note>
  <para>
   Actuellement, le manuel est disponible, partiellement ou en totalit&eacute;, dans les
   langues suivantes : 
   Allemand, Chinois (simplifi&eacute;), Chinois (traditionnel), Cor&eacute;en, Espagnol, 
   Finnois, Fran&ccedil;ais, H&eacute;breu, Hongrois, Italien, Japonais, N&eacute;erlandais, Polonais, 
   Portugais br&eacute;silien, Roumain, Russe, Slovaque, Slov&egrave;ne, Su&eacute;dois, 
   Tch&egrave;que et Turc.
  </para>
  <para>
   Ils peuvent tous &ecirc;tre t&eacute;l&eacute;charg&eacute;s ici : <ulink url="&url.php.docs;">&url.php.docs;</ulink>.
  </para>
 </sect1>

 <sect1 id="about.translations.fr">
  <title>Traduction fran&ccedil;aise</title>
  <para>
    La version fran&ccedil;aise est traduite quotidiennement et disponible
    chez Nexen (<ulink url="&url.nexen;">nexen.net/</ulink>).
    Ce manuel a &eacute;t&eacute; g&eacute;n&eacute;r&eacute; &agrave; partir de
    la documentation originale en anglais du &php; Documentation Group, au
    format XML. Elle est 100% compatible avec le syst&egrave;me de g&eacute;n&eacute;ration 
    du groupe &php;. Elle est trait&eacute; avec un syst&egrave;me d&eacute;velopp&eacute; par 
    Nexen pour produire divers autres formats.
   </para>
   <para>
    Pour les probl&egrave;mes li&eacute;s &agrave; la traduction, vous pouvez 
    contacter directement l'&eacute;diteur de ce manuel 
    <ulink url="mailto:&email.dams;">&email.dams;</ulink>.
   </para>
 </sect1>
</appendix>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
