<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.13 $ -->

<appendix id="history">
 <title>Histoire de &php;</title>
 <para>
  L'&eacute;volution de &php; s'est faite en quelques ann&eacute;es.
  Devenir un des langages les plus importants du web ne fut pas une 
  &eacute;volution simple. Pour ceux que &ccedil;a int&eacute;resse, voici comment &php; a
  &eacute;volu&eacute; jusqu'&agrave; aujourd'hui.
  Les vieilles versions de &php; sont disponibles dans le
  <ulink url="&url.php.museum;">mus&eacute;e &php;</ulink>.
 </para>
 
 <sect1 id="history.php">
  <title>Histoire de &php;</title>
  
  <sect2 id="history.phpfi">
   <title>&php;/FI</title>
   <para>
    &php; a pris la suite d'un langage plus ancien, appel&eacute; &php;/FI.
    &php;/FI a &eacute;t&eacute; cr&eacute;&eacute; par Rasmus Lerdorf, en 1995.
    C'&eacute;tait initialement une librairie de scripts Perl, dont il se
    servait pour noter les acc&egrave;s &agrave; CV en ligne. Il donna le nom de
    'Personnal Home Page Tools' &agrave; cette librairie. Au fur et &agrave;
    mesure qu'il ajoutait de nouvelles fonctionnalit&eacute;s, Rasmus a
    transform&eacute; la librairie en une impl&eacute;mentation en C, capable de
    communiquer avec les bases de donn&eacute;es, et de cr&eacute;er des
    applications dynamiques et simples pour le web. Rasmus d&eacute;cida alors
    de publier <ulink url="&url.php.release1.0.0;">son code</ulink>, pour 
    que tout le monde puisse l'utiliser et en
    profiter. Cela appela aussi aux contributions et aux am&eacute;liorations du
    code.
   </para>
   <para>
    &php;/FI, qui signifie Personal Home Page / Forms Interpreter,
    (Home Page personnelle, Interpreteur de Formulaire), incluait plusieurs
    fonctionnalit&eacute;s de base que nous connaissons encore aujourd'hui.
    Il avait ces variables qui ressemblent au Perl, un syst&egrave;me
    d'interpr&eacute;tation automatique des variables de formulaires, et une
    syntaxe qui s'int&egrave;gre facilement dans HTML.La syntaxe elle-m&ecirc;me
    &eacute;tait similaire &agrave; celle du Perl mais beaucoup plus
    limit&eacute;e. Elle &eacute;tait simple et un peu incoh&eacute;rente.
   </para>
   <para>
    En 1997, &php;/FI 2.0,la seconde version en langage C, avait d&eacute;j&agrave; une audience
    estim&eacute;e de plusieurs milliers d'utilisateurs dans le monde, et 
    environs 50,000 noms de domaine indiquaient qu'ils avaient install&eacute; &php;. 
    Cela repr&eacute;sentait environs 1% des noms de domaines sur l'Internet. M&ecirc;me si
    le nombre de contributeur &eacute;tait plut&ocirc;t &eacute;lev&eacute;, &php; &eacute;tait toujours le projet
    d'un seul homme.
   </para>
   <para>
    &php;/FI 2.0 fut publi&eacute; officiellement en novembre 1997, apr&egrave;s avoir 
    pass&eacute; l'essentiel de sa vie en version beta. Peu de temps apr&egrave;s, une version
    alpha de &php; 3.0 &eacute;tait publi&eacute;.
   </para>
  </sect2>

  <sect2 id="history.php3">
   <title>&php; 3</title>
   <para>
    &php; 3.0 fut la premi&egrave;re version du langage tel que nous le connaissons
    actuellement. Il fut cr&eacute;&eacute; par Andi Gutmans et Zeev
    Suraski en 1997, sous forme de r&eacute;&eacute;criture compl&egrave;te de &php;/FI, lorsqu'ils
    s'aper&ccedil;urent que &php;/FI &eacute;tait sous performant pour leur application de 
    commerce &eacute;lectronique. Dans un effort de coop&eacute;ration, et de compatibilit&eacute;
    avec les anciennes versions de &php;/FI, Andi, Rasmus et
    Zeev d&eacute;cid&egrave;rent de coop&eacute;rer et d'annoncer &php; 3.0 comme le successeur
    officiel de &php;/FI. Le d&eacute;veloppement de &php;/FI 2.0 fut compl&egrave;tement
    arr&ecirc;t&eacute;.
   </para>
   <para>
    Une des am&eacute;liorations notables de &php; 3.0 fut ses capacit&eacute;s
    d'extensions. En plus de fournir une solide infrastructure
    aux utilisateurs finaux, des acc&egrave;s &agrave; de nombreuses bases
    de donn&eacute;es et protocoles, &php; 3.0 proposait une API modulaire,
    qui attira des douzaines de d&eacute;veloppeurs. Ceux-ci r&eacute;alis&egrave;rent et
    partag&egrave;rent de nouvelles extensions. Sans doute, ce fut la cl&eacute;
    du succ&egrave;s retentissant de &php; 3.0. Les autres am&eacute;liorations de
    &php; 3.0 furent le support de la syntaxe objet, et une syntaxe de
    langage plus robuste et coh&eacute;rente.
   </para>
   <para>
    Le nouveau langage fut publi&eacute; sous un nouveau nom, qui indiquait
    clairement que le projet n'&eacute;tait plus un projet personnel, comme
    l'&eacute;tait &php;/FI 2.0. Il fut nomm&eacute; '&php;' avec une nouvelle signification : 
    '&php;: Hypertext Preprocessor'. C'est un acronyme r&eacute;cursif, c'est &agrave; dire
    qu'il se d&eacute;finit lui-m&ecirc;me. En fran&ccedil;ais, cela donne : 
    'Le pr&eacute;processeur Hypertexte, c'est &php;'.
   </para>
   <para>
    A la fin de 1998, &php; avait conquis une base de plusieurs dizaines de
    milliers d'utilisateurs, et des centaines de milliers de sites indiquaient
    qu'ils l'utilisaient. Au plus fort de son utilisation, &php; 3.0 &eacute;tait
    install&eacute; sur 10% du parc mondial de serveurs web mondial.
   </para>
   <para>
    &php; 3.0 fut officiellement publi&eacute; en Juin 1998, apr&egrave;s 9 mois de tests.
   </para>
  </sect2>

  <sect2 id="history.php4">
   <title>&php; 4</title>
   <para>
    Durant l'hiver 1998, juste apr&egrave;s la publication de &php; 3.0,
    Andi Gutmans et Zeev Suraski commenc&egrave;rent la r&eacute;&eacute;criture du moteur
    interne de &php; &agrave; la base. L'objectif &eacute;tait d'am&eacute;liorer les performances
    de &php; avec les applications complexes, et am&eacute;liorer la modularit&eacute; du code.
    Ces applications &eacute;taient rendues possibles par la syntaxe de &php; 3.0,
    mais le logiciel n'&eacute;tait pas con&ccedil;u pour supporter efficacement ces
    applications. 
   </para>
   <para>
    Le nouveau moteur, appel&eacute; 'Zend Engine' (combinaison des noms de 
    Zeev et Andi), atteint ces objectifs avec succ&egrave;s, et la premi&egrave;re version
    fut publi&eacute;e vers la mi-1999. &php; 4.0, s'appuyant sur ce moteur
    et am&eacute;lior&eacute; par un grand nombre de nouvelles fonctionnalit&eacute;s   
    fut publi&eacute; officiellement en mai 2000, presque 2 ans apr&egrave;s son
    pr&eacute;d&eacute;cesseur. En plus de performances nettement plus &eacute;lev&eacute;es,
    &php; 4.0 apportait le support de nombreux serveurs web, les sessions
    HTTP, la bufferisation de sortie, une s&eacute;curit&eacute; accrue des
    informations visiteurs et plusieurs nouvelles structures de
    langage.
   </para>
   <para>
    &php; 4 est actuellement la derni&egrave;re version de &php;. Le projet de &php; 5.0
    a d&eacute;j&agrave; d&eacute;but&eacute;, afin d'am&eacute;liorer le moteur Zend, et y int&eacute;grer des 
    capacit&eacute;s objets am&eacute;lior&eacute;es.
   </para>
   <para>
    Actuellement, &php; est utilis&eacute; par des centaines de milliers de d&eacute;veloppeurs,
    et plusieurs millions de sites web indiquent qu'ils sont configur&eacute;s avec
    &php;, ce qui repr&eacute;sente environs 20% des noms de domaines sur Internet.
   </para>
   <para>
    L'&eacute;quipe de d&eacute;veloppement de &php; inclue des douzaines de d&eacute;veloppeurs, et 
    d'autres &eacute;quipes travaillent &agrave; des projets li&eacute;s tels que PEAR ou la
    documentation.
   </para>
  </sect2>
  <sect2 id="history.php5">
   <title>&php; 5</title>
   <para>
    Le futur de &php; est essentiellement constitu&eacute; par son coeur, le Zend Engine.
    &php; 5 incluera la nouvelle version du Zend Engine 2.0. Pour plus d'informations
    sur ce moteur, <ulink url="&url.zend.future;">voyez sa page web</ulink>.
   </para>
  </sect2>
 </sect1>
 
 <sect1 id="history.php.related">
  <title>Quelques projets li&eacute;s &agrave; &php;</title>
  
  <!-- Hope Stig and/or Egon can do this
  
  <sect2 id="history.phpdoc">
   <title>&php; Documentation Project</title>
   <para>
   </para>
  </sect2>
  
  -->

  <sect2 id="history.pear">
   <title>PEAR</title>
   <para>
    PEAR, signifie '&php; Extension and Application Repository' 
    (initialement, &php; Extension and Add-on Repository) est la premi&egrave;re
    version de classe de base en &php;, et deviendra &agrave; terme le moyen
    privil&eacute;gi&eacute; de distribuer &php; et les modules C.
   </para>
   <para>
    PEAR a &eacute;t&eacute; con&ccedil;u durant les d&eacute;bats tenus lors des &php; Developers'
    Meeting (PDM) (Rencontres de d&eacute;veloppeurs &php;), qui ont eu lieu en 
    Janvier 2000 &agrave; Tel Aviv. Il a &eacute;t&eacute; cr&eacute;e &agrave; l'initiative de 
    Stig S. Bakken, et d&eacute;di&eacute; &agrave; sa premi&egrave;re fille, Malin Bakken.
   </para>
   <para>
    Depuis l'an 2000, PEAR a grossi jusqu'&agrave; devenir un projet significatif
    avec un groupe de d&eacute;veloppeur comp&eacute;tents, qui travaillent &agrave; mettre en place
    une librairie compl&egrave;te, r&eacute;utilisable et commune &agrave; la communaut&eacute; &php; enti&egrave;re.
    PEAR inclus une vaste s&eacute;lection de classes de bases pour r&eacute;aliser une 
    couche d'abstraction de bases de donn&eacute;es, du cache, des calculs
    math&eacute;matiques et des transactions de commerce &eacute;lectronique.
   </para>
  </sect2>

  <sect2 id="history.phpqa">
   <title>Equipe d'assurance Qualit&eacute;</title>
   <para>
    L'&eacute;quipe d'assurance Qualit&eacute; de &php; a &eacute;t&eacute; mise en place durant l'&eacute;t&eacute; 2000,
    en r&eacute;ponse aux critiques re&ccedil;ues par &php; 3.0, qui n'&eacute;tait pas suffisamment 
    test&eacute; sur des environnements de productions. L'&eacute;quipe est constitu&eacute; de
    d'un groupe de d&eacute;veloppeurs de haut niveau, qui ont une bonne connaissance
    des sources &php;. Ces d&eacute;veloppeurs passent le plus clair de leur temps
    &agrave; localiser et supprimer les bugs trouv&eacute;s dans &php;. De plus, il y a 
    bien d'autres membres du groupe &php; qui testent et fournissent un
    compte rendu fid&egrave;le de l'utilisation de &php; sur diff&eacute;rentes plate formes.
   </para>
  </sect2>

  <sect2 id="history.phpgtk">
   <title>&php;-GTK</title>
   <para>
    &php;-GTK est la solution &php; pour &eacute;crire des applications avec
    interface, cot&eacute; client. Andrei Zmievski se rappelle de la cr&eacute;ation 
    de &php;-GTK:
   </para>
   <blockquote>
    <para>
     La programmation d'interface GUI a toujours &eacute;t&eacute; une passion pour moi,
     et je pensais que Gtk+ &eacute;tait une excellente librairie, hormis le fait
     qu'elle &eacute;tait &eacute;crite en C, ce qui &eacute;tait plut&ocirc;t laborieux. 
     Apr&egrave;s avoir assist&eacute; aux impl&eacute;mentations de PyGtk et GTK-Perl,
     j'ai d&eacute;cid&eacute; de  voir si &php; pouvait disposer de sa propre interface 
     avec Gtk+, m&ecirc;me minimale. J'ai commenc&eacute; au mois d'ao&ucirc;t 2000, 
     lorsque j'avais un peu plus de temps libre, et j'ai r&eacute;alis&eacute; les 
     premi&egrave;res exp&eacute;rimentations. Mon guide principal fut l'impl&eacute;mentation de
     PyGtk, qui &eacute;tait plut&ocirc;t compl&egrave;te et avait une interface orient&eacute;e 
     objet. James Henstridge, l'auteur de PyGtk, fut d'une aide pr&eacute;cieuse au
     d&eacute;marrage du projet.
    </para>
    <para>
     R&eacute;&eacute;crire toutes les interfaces de Gtk+ &agrave; la main &eacute;tait hors de question
     et j'ai pens&eacute; &agrave; r&eacute;aliser un g&eacute;n&eacute;rateur de code, exactement comme 
     PyGtk l'avait fait. Le g&eacute;n&eacute;rateur de code &eacute;tait un programme &php; qui
     lisait un ensemble de fichiers .defs, contenant les classes, constantes
     et m&eacute;thodes Gtk+, puis g&eacute;n&eacute;rait le code d'interface de &php;. Ce qui ne
      pouvait pas &ecirc;tre g&eacute;n&eacute;r&eacute; automatiquement &eacute;tait trait&eacute;s &agrave; la main,
      dans le fichier .overrides.
    </para>
    <para>
     Travailler sur le g&eacute;n&eacute;rateur de code et sur l'infrastructure pris
     un peu de temps, car je n'avais pas beaucoup de temps &agrave; consacrer
     &agrave; &php;-GTK durant l'automne 2000. Apr&egrave;s avoir montr&eacute; &php;-GTK &agrave;
     Frank Kromann, il s'y int&eacute;ressa, et commen&ccedil;a  &agrave; m'aider sur le g&eacute;n&eacute;rateur
     et l'impl&eacute;mentation Win32. Lorsque nous &eacute;criv&icirc;mes le premier programme
     'Hello World', ce fut extr&ecirc;mement excitant. Cela a pris encore 
     quelques mois pour avoir une version initiale. Elle fut publi&eacute;e en 
     mars 2001. Cela a encore pris quelques mois pour que le projet soit dans
     une forme pr&eacute;sentable. Ce projet fut rapidement pr&eacute;sent&eacute; sur SlashDot.
    </para>
    <para>
     Anticipant que &php; serait un projet &agrave; part enti&egrave;re, j'ai install&eacute;
     des listes de diffusion et un serveur CVS ind&eacute;pendants, de m&ecirc;me que
     le site gtk.php.net, avec l'aide de Colin Viebrock. La documentation
     demandait aussi de l'aide, et James Moore vient me porter une aide
     pr&eacute;cieuse.
    </para>
    <para>
     Depuis sa publication &php;-GTK a gagn&eacute; en popularit&eacute;. Nous avons
     notre propre &eacute;quipe de documentation, et le manuel s'am&eacute;liore de
     plus en plus. Des extensions ont &eacute;t&eacute; &eacute;crites pour &php;-GTK et des
     applications de plus en plus importantes sont concues.
    </para>
   </blockquote>
  </sect2>
 </sect1>

 <sect1 id="history.php.books">
  <title>Livres traitant de &php;</title>
  <para>
   Comme &php; a &eacute;volu&eacute;, il a &eacute;t&eacute; reconnu comme une
   plate forme de d&eacute;veloppement populaire. Un des signes qui ne trompe
   pas est le nombre de livres d&eacute;di&eacute; &agrave; &php; a 
    &eacute;volu&eacute; paralellement.
  </para>
  <para>
   Autant que nous le sachions, le premier livre d&eacute;di&eacute; &agrave;
   &php; a &eacute;t&eacute; 'php- dynamische webauftritte professionell
   realisieren' - un livre en allemand, &eacute;crit par Egon Schmid, Christian
   Cartus et Richard Blume. Le premier livre en anglais sur &php; fut 
   publi&eacute; juste apr&egrave;s : 'Core &php; Programming' par Leon Atkinson. 
   Ces deux livres couvraient &php; 3.0.
  </para>
  <para>
   M&ecirc;me si ces deux livres restent uniques dans leur genre, ils
   furent rapidement suivis par un grand nombre d'autres livres,
   de diff&eacute;rents &eacute;diteurs. Il y a plus de 40 livres en anglais,
   50 en allemand et plus de 20 en fran&ccedil;ais. De plus, on peut maintenant
   trouver des livres sur &php; en espagnol, cor&eacute;en, japonais et 
   h&eacute;breux.
  </para>
  <para>
   Clairement, ce nombre grandissant de livres, &eacute;crit par 
   diff&eacute;rents auteurs, publi&eacute;s par diff&eacute;rents
   &eacute;diteurs et leur disponibilit&eacute; en diff&eacute;rentes langues
   est un t&eacute;moingnage du succ&egrave;s plan&eacute;taire de &php;.
  </para>
 </sect1>
 
 <sect1 id="history.php.publications">
  <title>Publications sur &php;</title>
  <para>
   Autant que nous le sachions, le premier article consacr&eacute; &agrave; &php;
   dans un magasine papier fut publi&eacute; dans un magazine Francais,
   vers la fin 1998 et couvrait &php; 3.0. Comme tous les livres, ce
   fut le premier d'une longue s&eacute;rie d'articles publi&eacute;s dans diff&eacute;rents
   magazines.
  </para>
  <para>
   Des articles sur &php; ont &eacute;t&eacute; publi&eacute;s dans Dr. Dobbs, Linux Enterprise,
   Linux Magazine et bien d'autres. Des articles sur la migration d'applications
   &php; vers un environnement Windows existe dans la librarie MSDN de Microsoft.
  </para>
 </sect1>

</appendix>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
